apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_ANALOG_TOP_ISO_SLEEP : R/W; bitpos: [23]; default: 0;
 * PLLA force power down
 */

#define RTC_CNTL_ANALOG_TOP_ISO_SLEEP    (BIT(23))
#define RTC_CNTL_ANALOG_TOP_ISO_SLEEP_M  (RTC_CNTL_ANALOG_TOP_ISO_SLEEP_V << RTC_CNTL_ANALOG_TOP_ISO_SLEEP_S)
#define RTC_CNTL_ANALOG_TOP_ISO_SLEEP_V  0x00000001
#define RTC_CNTL_ANALOG_TOP_ISO_SLEEP_S  23

/* RTC_CNTL_SAR_I2C_PU : R/W; bitpos: [22]; default: 1;
 * PLLA force power up
 */

#define RTC_CNTL_SAR_I2C_PU    (BIT(22))
#define RTC_CNTL_SAR_I2C_PU_M  (RTC_CNTL_SAR_I2C_PU_V << RTC_CNTL_SAR_I2C_PU_S)
#define RTC_CNTL_SAR_I2C_PU_V  0x00000001
#define RTC_CNTL_SAR_I2C_PU_S  22

/* RTC_CNTL_GLITCH_RST_EN : R/W; bitpos: [20]; default: 0;
 * enable clk glitch
 */

#define RTC_CNTL_GLITCH_RST_EN    (BIT(20))
#define RTC_CNTL_GLITCH_RST_EN_M  (RTC_CNTL_GLITCH_RST_EN_V << RTC_CNTL_GLITCH_RST_EN_S)
#define RTC_CNTL_GLITCH_RST_EN_V  0x00000001
#define RTC_CNTL_GLITCH_RST_EN_S  20

/* RTC_CNTL_I2C_RESET_POR_FORCE_PU : R/W; bitpos: [19]; default: 0;
 * force on I2C_RESET_POR
 */

#define RTC_CNTL_I2C_RESET_POR_FORCE_PU    (BIT(19))
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_M  (RTC_CNTL_I2C_RESET_POR_FORCE_PU_V << RTC_CNTL_I2C_RESET_POR_FORCE_PU_S)
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_V  0x00000001
#define RTC_CNTL_I2C_RESET_POR_FORCE_PU_S  19

/* RTC_CNTL_I2C_RESET_POR_FORCE_PD : R/W; bitpos: [18]; default: 1;
 * force down I2C_RESET_POR
 */

#define RTC_CNTL_I2C_RESET_POR_FORCE_PD    (BIT(18))
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_M  (RTC_CNTL_I2C_RESET_POR_FORCE_PD_V << RTC_CNTL_I2C_RESET_POR_FORCE_PD_S)
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_V  0x00000001
#define RTC_CNTL_I2C_RESET_POR_FORCE_PD_S  18

/* RTC_CNTL_RTC_RESET_STATE_REG register
 * get reset state
 */

#define RTC_CNTL_RTC_RESET_STATE_REG (DR_REG_RTCCNTL_BASE + 0x38)

/* RTC_CNTL_RTC_PRO_DRESET_MASK : R/W; bitpos: [25]; default: 0;
 * bypass cpu0 dreset
 */

#define RTC_CNTL_RTC_PRO_DRESET_MASK    (BIT(25))
#define RTC_CNTL_RTC_PRO_DRESET_MASK_M  (RTC_CNTL_RTC_PRO_DRESET_MASK_V << RTC_CNTL_RTC_PRO_DRESET_MASK_S)
#define RTC_CNTL_RTC_PRO_DRESET_MASK_V  0x00000001
#define RTC_CNTL_RTC_PRO_DRESET_MASK_S  25

/* RTC_CNTL_RTC_APP_DRESET_MASK : R/W; bitpos: [24]; default: 0;
 * bypass cpu1 dreset
 */

#define RTC_CNTL_RTC_APP_DRESET_MASK    (BIT(24))
#define RTC_CNTL_RTC_APP_DRESET_MASK_M  (RTC_CNTL_RTC_APP_DRESET_MASK_V << RTC_CNTL_RTC_APP_DRESET_MASK_S)
#define RTC_CNTL_RTC_APP_DRESET_MASK_V  0x00000001
#define RTC_CNTL_RTC_APP_DRESET_MASK_S  24

/* RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR : WO; bitpos: [23]; default: 0;
 * clear jtag reset flag
 */

#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR    (BIT(23))
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR_M  (RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR_V << RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR_S)
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR_V  0x00000001
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_CLR_S  23

/* RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR : WO; bitpos: [22]; default: 0;
 * clear jtag reset flag
 */

#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR    (BIT(22))
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR_M  (RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR_V << RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR_S)
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR_V  0x00000001
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_CLR_S  22

/* RTC_CNTL_RESET_FLAG_JTAG_APPCPU : RO; bitpos: [21]; default: 0;
 * jtag reset flag
 */

#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU    (BIT(21))
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_M  (RTC_CNTL_RESET_FLAG_JTAG_APPCPU_V << RTC_CNTL_RESET_FLAG_JTAG_APPCPU_S)
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_V  0x00000001
#define RTC_CNTL_RESET_FLAG_JTAG_APPCPU_S  21

/* RTC_CNTL_RESET_FLAG_JTAG_PROCPU : RO; bitpos: [20]; default: 0;
 * jtag reset flag
 */

#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU    (BIT(20))
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_M  (RTC_CNTL_RESET_FLAG_JTAG_PROCPU_V << RTC_CNTL_RESET_FLAG_JTAG_PROCPU_S)
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_V  0x00000001
#define RTC_CNTL_RESET_FLAG_JTAG_PROCPU_S  20

/* RTC_CNTL_PROCPU_OCD_HALT_ON_RESET : R/W; bitpos: [19]; default: 0;
 * PROCPU OcdHaltOnReset
 */

#define RTC_CNTL_PROCPU_OCD_HALT_ON_RESET    (BIT(19))
#define RTC_CNTL_PROCPU_OCD_HALT_ON_RESET_M  (RTC_CNTL_PROCPU_OCD_HALT_ON_RESET_V << RTC_CNTL_PROCPU_OCD_HALT_ON_RESET_S)
#define RTC_CNTL_PROCPU_OCD_HALT_ON_RESET_V  0x00000001
#define RTC_CNTL_PROCPU_OCD_HALT_ON_RESET_S  19

/* RTC_CNTL_APPCPU_OCD_HALT_ON_RESET : R/W; bitpos: [18]; default: 0;
 * APPCPU OcdHaltOnReset
 */

#define RTC_CNTL_APPCPU_OCD_HALT_ON_RESET    (BIT(18))
#define RTC_CNTL_APPCPU_OCD_HALT_ON_RESET_M  (RTC_CNTL_APPCPU_OCD_HALT_ON_RESET_V << RTC_CNTL_APPCPU_OCD_HALT_ON_RESET_S)
#define RTC_CNTL_APPCPU_OCD_HALT_ON_RESET_V  0x00000001
#define RTC_CNTL_APPCPU_OCD_HALT_ON_RESET_S  18

/* RTC_CNTL_RESET_FLAG_APPCPU_CLR : WO; bitpos: [17]; default: 0;
 * clear APP CPU reset flag
 */

#define RTC_CNTL_RESET_FLAG_APPCPU_CLR    (BIT(17))
#define RTC_CNTL_RESET_FLAG_APPCPU_CLR_M  (RTC_CNTL_RESET_FLAG_APPCPU_CLR_V << RTC_CNTL_RESET_FLAG_APPCPU_CLR_S)
#define RTC_CNTL_RESET_FLAG_APPCPU_CLR_V  0x00000001
#define RTC_CNTL_RESET_FLAG_APPCPU_CLR_S  17

/* RTC_CNTL_RESET_FLAG_PROCPU_CLR : WO; bitpos: [16]; default: 0;
 * clear PRO CPU reset_flag
 */

#define RTC_CNTL_RESET_FLAG_PROCPU_CLR    (BIT(16))
#define RTC_CNTL_RESET_FLAG_PROCPU_CLR_M  (RTC_CNTL_RESET_FLAG_PROCPU_CLR_V << RTC_CNTL_RESET_FLAG_PROCPU_CLR_S)
#define RTC_CNTL_RESET_FLAG_PROCPU_CLR_V  0x00000001
#define RTC_CNTL_RESET_FLAG_PROCPU_CLR_S  16

/* RTC_CNTL_RESET_FLAG_APPCPU : RO; bitpos: [15]; default: 0;
 * APP CPU reset flag
 */

#define RTC_CNTL_RESET_FLAG_APPCPU    (BIT(15))
#define RTC_CNTL_RESET_FLAG_APPCPU_M  (RTC_CNTL_RESET_FLAG_APPCPU_V << RTC_CNTL_RESET_FLAG_APPCPU_S)
#define RTC_CNTL_RESET_FLAG_APPCPU_V  0x00000001
#define RTC_CNTL_RESET_FLAG_APPCPU_S  15

/* RTC_CNTL_RESET_FLAG_PROCPU : RO; bitpos: [14]; default: 0;
 * PRO CPU reset_flag
 */

#define RTC_CNTL_RESET_FLAG_PROCPU    (BIT(14))
#define RTC_CNTL_RESET_FLAG_PROCPU_M  (RTC_CNTL_RESET_FLAG_PROCPU_V << RTC_CNTL_RESET_FLAG_PROCPU_S)
#define RTC_CNTL_RESET_FLAG_PROCPU_V  0x00000001
#define RTC_CNTL_RESET_FLAG_PROCPU_S  14

