apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_PROCPU_STAT_VECTOR_SEL : R/W; bitpos: [13]; default: 1;
 * PRO CPU state vector sel
 */

#define RTC_CNTL_PROCPU_STAT_VECTOR_SEL    (BIT(13))
#define RTC_CNTL_PROCPU_STAT_VECTOR_SEL_M  (RTC_CNTL_PROCPU_STAT_VECTOR_SEL_V << RTC_CNTL_PROCPU_STAT_VECTOR_SEL_S)
#define RTC_CNTL_PROCPU_STAT_VECTOR_SEL_V  0x00000001
#define RTC_CNTL_PROCPU_STAT_VECTOR_SEL_S  13

/* RTC_CNTL_APPCPU_STAT_VECTOR_SEL : R/W; bitpos: [12]; default: 1;
 * APP CPU state vector sel
 */

#define RTC_CNTL_APPCPU_STAT_VECTOR_SEL    (BIT(12))
#define RTC_CNTL_APPCPU_STAT_VECTOR_SEL_M  (RTC_CNTL_APPCPU_STAT_VECTOR_SEL_V << RTC_CNTL_APPCPU_STAT_VECTOR_SEL_S)
#define RTC_CNTL_APPCPU_STAT_VECTOR_SEL_V  0x00000001
#define RTC_CNTL_APPCPU_STAT_VECTOR_SEL_S  12

/* RTC_CNTL_RESET_CAUSE_APPCPU : RO; bitpos: [11:6]; default: 0;
 * reset cause of APP CPU
 */

#define RTC_CNTL_RESET_CAUSE_APPCPU    0x0000003f
#define RTC_CNTL_RESET_CAUSE_APPCPU_M  (RTC_CNTL_RESET_CAUSE_APPCPU_V << RTC_CNTL_RESET_CAUSE_APPCPU_S)
#define RTC_CNTL_RESET_CAUSE_APPCPU_V  0x0000003f
#define RTC_CNTL_RESET_CAUSE_APPCPU_S  6

/* RTC_CNTL_RESET_CAUSE_PROCPU : RO; bitpos: [5:0]; default: 0;
 * reset cause of PRO CPU
 */

#define RTC_CNTL_RESET_CAUSE_PROCPU    0x0000003f
#define RTC_CNTL_RESET_CAUSE_PROCPU_M  (RTC_CNTL_RESET_CAUSE_PROCPU_V << RTC_CNTL_RESET_CAUSE_PROCPU_S)
#define RTC_CNTL_RESET_CAUSE_PROCPU_V  0x0000003f
#define RTC_CNTL_RESET_CAUSE_PROCPU_S  0

/* RTC_CNTL_RTC_WAKEUP_STATE_REG register
 * configure wakeup state
 */

#define RTC_CNTL_RTC_WAKEUP_STATE_REG (DR_REG_RTCCNTL_BASE + 0x3c)

/* RTC_CNTL_RTC_WAKEUP_ENA : R/W; bitpos: [31:15]; default: 12;
 * wakeup enable bitmap
 */

#define RTC_CNTL_RTC_WAKEUP_ENA    0x0001ffff
#define RTC_CNTL_RTC_WAKEUP_ENA_M  (RTC_CNTL_RTC_WAKEUP_ENA_V << RTC_CNTL_RTC_WAKEUP_ENA_S)
#define RTC_CNTL_RTC_WAKEUP_ENA_V  0x0001ffff
#define RTC_CNTL_RTC_WAKEUP_ENA_S  15

/* RTC_CNTL_INT_ENA_RTC_REG register
 * configure rtc interrupt register
 */

#define RTC_CNTL_INT_ENA_RTC_REG (DR_REG_RTCCNTL_BASE + 0x40)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA : R/W; bitpos: [20];
 * default: 0;
 * touch approach mode loop interrupt
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_ENA : R/W; bitpos: [19]; default: 0;
 * enbale gitch det interrupt
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_M  (RTC_CNTL_RTC_GLITCH_DET_INT_ENA_V << RTC_CNTL_RTC_GLITCH_DET_INT_ENA_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA : R/W; bitpos: [18]; default: 0;
 * enable touch timeout interrupt
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_ENA : R/W; bitpos: [17]; default: 0;
 * enable cocpu trap interrupt
 */

#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_V << RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA : R/W; bitpos: [16]; default: 0;
 * enable xtal32k_dead  interrupt
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_S  16

/* RTC_CNTL_RTC_SWD_INT_ENA : R/W; bitpos: [15]; default: 0;
 * enable super watch dog interrupt
 */

#define RTC_CNTL_RTC_SWD_INT_ENA    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_ENA_M  (RTC_CNTL_RTC_SWD_INT_ENA_V << RTC_CNTL_RTC_SWD_INT_ENA_S)
#define RTC_CNTL_RTC_SWD_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_ENA_S  15

/* RTC_CNTL_RTC_SARADC2_INT_ENA : R/W; bitpos: [14]; default: 0;
 * enable saradc2 interrupt
 */

#define RTC_CNTL_RTC_SARADC2_INT_ENA    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_ENA_M  (RTC_CNTL_RTC_SARADC2_INT_ENA_V << RTC_CNTL_RTC_SARADC2_INT_ENA_S)
#define RTC_CNTL_RTC_SARADC2_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_ENA_S  14

/* RTC_CNTL_RTC_COCPU_INT_ENA : R/W; bitpos: [13]; default: 0;
 * enable riscV cocpu interrupt
 */

#define RTC_CNTL_RTC_COCPU_INT_ENA    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_ENA_M  (RTC_CNTL_RTC_COCPU_INT_ENA_V << RTC_CNTL_RTC_COCPU_INT_ENA_S)
#define RTC_CNTL_RTC_COCPU_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_ENA_S  13

/* RTC_CNTL_RTC_TSENS_INT_ENA : R/W; bitpos: [12]; default: 0;
 * enable tsens interrupt
 */

#define RTC_CNTL_RTC_TSENS_INT_ENA    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_ENA_M  (RTC_CNTL_RTC_TSENS_INT_ENA_V << RTC_CNTL_RTC_TSENS_INT_ENA_S)
#define RTC_CNTL_RTC_TSENS_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_ENA_S  12

/* RTC_CNTL_RTC_SARADC1_INT_ENA : R/W; bitpos: [11]; default: 0;
 * enable saradc1 interrupt
 */

#define RTC_CNTL_RTC_SARADC1_INT_ENA    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_ENA_M  (RTC_CNTL_RTC_SARADC1_INT_ENA_V << RTC_CNTL_RTC_SARADC1_INT_ENA_S)
#define RTC_CNTL_RTC_SARADC1_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_ENA_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_ENA : R/W; bitpos: [10]; default: 0;
 * enable RTC main timer interrupt
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_V << RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_S  10

