apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_RTC_BROWN_OUT_INT_ENA : R/W; bitpos: [9]; default: 0;
 * enable brown out interrupt
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_M  (RTC_CNTL_RTC_BROWN_OUT_INT_ENA_V << RTC_CNTL_RTC_BROWN_OUT_INT_ENA_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA : R/W; bitpos: [8]; default: 0;
 * enable touch inactive interrupt
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA : R/W; bitpos: [7]; default: 0;
 * enable touch active interrupt
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_ENA : R/W; bitpos: [6]; default: 0;
 * enable touch done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_V << RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_ENA : R/W; bitpos: [5]; default: 0;
 * enable ULP-coprocessor interrupt
 */

#define RTC_CNTL_RTC_ULP_CP_INT_ENA    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_M  (RTC_CNTL_RTC_ULP_CP_INT_ENA_V << RTC_CNTL_RTC_ULP_CP_INT_ENA_S)
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_S  5

/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA : R/W; bitpos: [4]; default: 0;
 * enable touch scan done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_S  4

/* RTC_CNTL_RTC_WDT_INT_ENA : R/W; bitpos: [3]; default: 0;
 * enable RTC WDT interrupt
 */

#define RTC_CNTL_RTC_WDT_INT_ENA    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_ENA_M  (RTC_CNTL_RTC_WDT_INT_ENA_V << RTC_CNTL_RTC_WDT_INT_ENA_S)
#define RTC_CNTL_RTC_WDT_INT_ENA_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_ENA_S  3

/* RTC_CNTL_SDIO_IDLE_INT_ENA : R/W; bitpos: [2]; default: 0;
 * enable SDIO idle interrupt
 */

#define RTC_CNTL_SDIO_IDLE_INT_ENA    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_M  (RTC_CNTL_SDIO_IDLE_INT_ENA_V << RTC_CNTL_SDIO_IDLE_INT_ENA_S)
#define RTC_CNTL_SDIO_IDLE_INT_ENA_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_ENA_S  2

/* RTC_CNTL_SLP_REJECT_INT_ENA : R/W; bitpos: [1]; default: 0;
 * enable sleep reject interrupt
 */

#define RTC_CNTL_SLP_REJECT_INT_ENA    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_M  (RTC_CNTL_SLP_REJECT_INT_ENA_V << RTC_CNTL_SLP_REJECT_INT_ENA_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_ENA_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_ENA : R/W; bitpos: [0]; default: 0;
 * enable sleep wakeup interrupt
 */

#define RTC_CNTL_SLP_WAKEUP_INT_ENA    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_S  0

/* RTC_CNTL_INT_RAW_RTC_REG register
 * rtc interrupt register
 */

#define RTC_CNTL_INT_RAW_RTC_REG (DR_REG_RTCCNTL_BASE + 0x44)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW : R/W; bitpos: [20];
 * default: 0;
 * touch approach mode loop interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_RAW_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_RAW : RO; bitpos: [19]; default: 0;
 * glitch_det_interrupt_raw
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_RAW    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_RAW_M  (RTC_CNTL_RTC_GLITCH_DET_INT_RAW_V << RTC_CNTL_RTC_GLITCH_DET_INT_RAW_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_RAW_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW : RO; bitpos: [18]; default: 0;
 * touch timeout interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_RAW_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_RAW : RO; bitpos: [17]; default: 0;
 * cocpu trap interrupt raw
 */

#define RTC_CNTL_RTC_COCPU_TRAP_INT_RAW    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_RAW_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_RAW_V << RTC_CNTL_RTC_COCPU_TRAP_INT_RAW_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_RAW_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW : RO; bitpos: [16]; default: 0;
 * xtal32k dead detection interrupt raw
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_RAW_S  16

/* RTC_CNTL_RTC_SWD_INT_RAW : RO; bitpos: [15]; default: 0;
 * super watch dog interrupt raw
 */

#define RTC_CNTL_RTC_SWD_INT_RAW    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_RAW_M  (RTC_CNTL_RTC_SWD_INT_RAW_V << RTC_CNTL_RTC_SWD_INT_RAW_S)
#define RTC_CNTL_RTC_SWD_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_RAW_S  15

/* RTC_CNTL_RTC_SARADC2_INT_RAW : RO; bitpos: [14]; default: 0;
 * saradc2 interrupt raw
 */

