apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_RTC_SARADC2_INT_RAW    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_RAW_M  (RTC_CNTL_RTC_SARADC2_INT_RAW_V << RTC_CNTL_RTC_SARADC2_INT_RAW_S)
#define RTC_CNTL_RTC_SARADC2_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_RAW_S  14

/* RTC_CNTL_RTC_COCPU_INT_RAW : RO; bitpos: [13]; default: 0;
 * riscV cocpu interrupt raw
 */

#define RTC_CNTL_RTC_COCPU_INT_RAW    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_RAW_M  (RTC_CNTL_RTC_COCPU_INT_RAW_V << RTC_CNTL_RTC_COCPU_INT_RAW_S)
#define RTC_CNTL_RTC_COCPU_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_RAW_S  13

/* RTC_CNTL_RTC_TSENS_INT_RAW : RO; bitpos: [12]; default: 0;
 * tsens interrupt raw
 */

#define RTC_CNTL_RTC_TSENS_INT_RAW    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_RAW_M  (RTC_CNTL_RTC_TSENS_INT_RAW_V << RTC_CNTL_RTC_TSENS_INT_RAW_S)
#define RTC_CNTL_RTC_TSENS_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_RAW_S  12

/* RTC_CNTL_RTC_SARADC1_INT_RAW : RO; bitpos: [11]; default: 0;
 * saradc1 interrupt raw
 */

#define RTC_CNTL_RTC_SARADC1_INT_RAW    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_RAW_M  (RTC_CNTL_RTC_SARADC1_INT_RAW_V << RTC_CNTL_RTC_SARADC1_INT_RAW_S)
#define RTC_CNTL_RTC_SARADC1_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_RAW_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_RAW : RO; bitpos: [10]; default: 0;
 * RTC main timer interrupt raw
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_RAW    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_RAW_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_RAW_V << RTC_CNTL_RTC_MAIN_TIMER_INT_RAW_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_RAW_S  10

/* RTC_CNTL_RTC_BROWN_OUT_INT_RAW : RO; bitpos: [9]; default: 0;
 * brown out interrupt raw
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_RAW    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_RAW_M  (RTC_CNTL_RTC_BROWN_OUT_INT_RAW_V << RTC_CNTL_RTC_BROWN_OUT_INT_RAW_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_RAW_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW : RO; bitpos: [8]; default: 0;
 * touch inactive interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_RAW_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW : RO; bitpos: [7]; default: 0;
 * touch active interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_RAW_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_RAW : RO; bitpos: [6]; default: 0;
 * touch interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_RAW    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_RAW_V << RTC_CNTL_RTC_TOUCH_DONE_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_RAW_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_RAW : RO; bitpos: [5]; default: 0;
 * ULP-coprocessor interrupt raw
 */

#define RTC_CNTL_RTC_ULP_CP_INT_RAW    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_RAW_M  (RTC_CNTL_RTC_ULP_CP_INT_RAW_V << RTC_CNTL_RTC_ULP_CP_INT_RAW_S)
#define RTC_CNTL_RTC_ULP_CP_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_RAW_S  5

/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW : RO; bitpos: [4]; default: 0;
 * enable touch scan done interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_RAW_S  4

/* RTC_CNTL_RTC_WDT_INT_RAW : RO; bitpos: [3]; default: 0;
 * RTC WDT interrupt raw
 */

#define RTC_CNTL_RTC_WDT_INT_RAW    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_RAW_M  (RTC_CNTL_RTC_WDT_INT_RAW_V << RTC_CNTL_RTC_WDT_INT_RAW_S)
#define RTC_CNTL_RTC_WDT_INT_RAW_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_RAW_S  3

/* RTC_CNTL_SDIO_IDLE_INT_RAW : RO; bitpos: [2]; default: 0;
 * SDIO idle interrupt raw
 */

#define RTC_CNTL_SDIO_IDLE_INT_RAW    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_RAW_M  (RTC_CNTL_SDIO_IDLE_INT_RAW_V << RTC_CNTL_SDIO_IDLE_INT_RAW_S)
#define RTC_CNTL_SDIO_IDLE_INT_RAW_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_RAW_S  2

/* RTC_CNTL_SLP_REJECT_INT_RAW : RO; bitpos: [1]; default: 0;
 * sleep reject interrupt raw
 */

#define RTC_CNTL_SLP_REJECT_INT_RAW    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_RAW_M  (RTC_CNTL_SLP_REJECT_INT_RAW_V << RTC_CNTL_SLP_REJECT_INT_RAW_S)
#define RTC_CNTL_SLP_REJECT_INT_RAW_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_RAW_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_RAW : RO; bitpos: [0]; default: 0;
 * sleep wakeup interrupt raw
 */

#define RTC_CNTL_SLP_WAKEUP_INT_RAW    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_M  (RTC_CNTL_SLP_WAKEUP_INT_RAW_V << RTC_CNTL_SLP_WAKEUP_INT_RAW_S)
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_RAW_S  0

/* RTC_CNTL_INT_ST_RTC_REG register
 * rtc interrupt register
 */

#define RTC_CNTL_INT_ST_RTC_REG (DR_REG_RTCCNTL_BASE + 0x48)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST : RO; bitpos: [20]; default:
 * 0;
 * touch approach mode loop interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ST_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_ST : RO; bitpos: [19]; default: 0;
 * glitch_det_interrupt state
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_ST    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_ST_M  (RTC_CNTL_RTC_GLITCH_DET_INT_ST_V << RTC_CNTL_RTC_GLITCH_DET_INT_ST_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_ST_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST : RO; bitpos: [18]; default: 0;
 * Touch timeout interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ST_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_ST : RO; bitpos: [17]; default: 0;
 * cocpu trap interrupt state
 */

