apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ST    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ST_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_ST_V << RTC_CNTL_RTC_COCPU_TRAP_INT_ST_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ST_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST : RO; bitpos: [16]; default: 0;
 * xtal32k dead detection interrupt state
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ST_S  16

/* RTC_CNTL_RTC_SWD_INT_ST : RO; bitpos: [15]; default: 0;
 * super watch dog interrupt state
 */

#define RTC_CNTL_RTC_SWD_INT_ST    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_ST_M  (RTC_CNTL_RTC_SWD_INT_ST_V << RTC_CNTL_RTC_SWD_INT_ST_S)
#define RTC_CNTL_RTC_SWD_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_ST_S  15

/* RTC_CNTL_RTC_SARADC2_INT_ST : RO; bitpos: [14]; default: 0;
 * saradc2 interrupt state
 */

#define RTC_CNTL_RTC_SARADC2_INT_ST    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_ST_M  (RTC_CNTL_RTC_SARADC2_INT_ST_V << RTC_CNTL_RTC_SARADC2_INT_ST_S)
#define RTC_CNTL_RTC_SARADC2_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_ST_S  14

/* RTC_CNTL_RTC_COCPU_INT_ST : RO; bitpos: [13]; default: 0;
 * riscV cocpu interrupt state
 */

#define RTC_CNTL_RTC_COCPU_INT_ST    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_ST_M  (RTC_CNTL_RTC_COCPU_INT_ST_V << RTC_CNTL_RTC_COCPU_INT_ST_S)
#define RTC_CNTL_RTC_COCPU_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_ST_S  13

/* RTC_CNTL_RTC_TSENS_INT_ST : RO; bitpos: [12]; default: 0;
 * tsens interrupt state
 */

#define RTC_CNTL_RTC_TSENS_INT_ST    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_ST_M  (RTC_CNTL_RTC_TSENS_INT_ST_V << RTC_CNTL_RTC_TSENS_INT_ST_S)
#define RTC_CNTL_RTC_TSENS_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_ST_S  12

/* RTC_CNTL_RTC_SARADC1_INT_ST : RO; bitpos: [11]; default: 0;
 * saradc1 interrupt state
 */

#define RTC_CNTL_RTC_SARADC1_INT_ST    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_ST_M  (RTC_CNTL_RTC_SARADC1_INT_ST_V << RTC_CNTL_RTC_SARADC1_INT_ST_S)
#define RTC_CNTL_RTC_SARADC1_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_ST_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_ST : RO; bitpos: [10]; default: 0;
 * RTC main timer interrupt state
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_ST    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ST_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_ST_V << RTC_CNTL_RTC_MAIN_TIMER_INT_ST_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ST_S  10

/* RTC_CNTL_RTC_BROWN_OUT_INT_ST : RO; bitpos: [9]; default: 0;
 * brown out interrupt state
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_ST    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_ST_M  (RTC_CNTL_RTC_BROWN_OUT_INT_ST_V << RTC_CNTL_RTC_BROWN_OUT_INT_ST_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_ST_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST : RO; bitpos: [8]; default: 0;
 * touch inactive interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ST_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST : RO; bitpos: [7]; default: 0;
 * touch active interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ST_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_ST : RO; bitpos: [6]; default: 0;
 * touch done interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_ST    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ST_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_ST_V << RTC_CNTL_RTC_TOUCH_DONE_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ST_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_ST : RO; bitpos: [5]; default: 0;
 * ULP-coprocessor interrupt state
 */

#define RTC_CNTL_RTC_ULP_CP_INT_ST    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_ST_M  (RTC_CNTL_RTC_ULP_CP_INT_ST_V << RTC_CNTL_RTC_ULP_CP_INT_ST_S)
#define RTC_CNTL_RTC_ULP_CP_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_ST_S  5

/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 * enable touch scan done interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ST_S  4

/* RTC_CNTL_RTC_WDT_INT_ST : RO; bitpos: [3]; default: 0;
 * RTC WDT interrupt state
 */

#define RTC_CNTL_RTC_WDT_INT_ST    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_ST_M  (RTC_CNTL_RTC_WDT_INT_ST_V << RTC_CNTL_RTC_WDT_INT_ST_S)
#define RTC_CNTL_RTC_WDT_INT_ST_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_ST_S  3

/* RTC_CNTL_SDIO_IDLE_INT_ST : RO; bitpos: [2]; default: 0;
 * SDIO idle interrupt state
 */

#define RTC_CNTL_SDIO_IDLE_INT_ST    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ST_M  (RTC_CNTL_SDIO_IDLE_INT_ST_V << RTC_CNTL_SDIO_IDLE_INT_ST_S)
#define RTC_CNTL_SDIO_IDLE_INT_ST_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_ST_S  2

/* RTC_CNTL_SLP_REJECT_INT_ST : RO; bitpos: [1]; default: 0;
 * sleep reject interrupt state
 */

#define RTC_CNTL_SLP_REJECT_INT_ST    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ST_M  (RTC_CNTL_SLP_REJECT_INT_ST_V << RTC_CNTL_SLP_REJECT_INT_ST_S)
#define RTC_CNTL_SLP_REJECT_INT_ST_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_ST_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_ST : RO; bitpos: [0]; default: 0;
 * sleep wakeup interrupt state
 */

#define RTC_CNTL_SLP_WAKEUP_INT_ST    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ST_M  (RTC_CNTL_SLP_WAKEUP_INT_ST_V << RTC_CNTL_SLP_WAKEUP_INT_ST_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ST_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_ST_S  0

