apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_INT_CLR_RTC_REG register
 * rtc interrupt register
 */

#define RTC_CNTL_INT_CLR_RTC_REG (DR_REG_RTCCNTL_BASE + 0x4c)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR : WO; bitpos: [20];
 * default: 0;
 * cleartouch approach mode loop interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_CLR_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_CLR : WO; bitpos: [19]; default: 0;
 * Clear glitch det interrupt state
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_CLR    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_CLR_M  (RTC_CNTL_RTC_GLITCH_DET_INT_CLR_V << RTC_CNTL_RTC_GLITCH_DET_INT_CLR_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_CLR_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR : WO; bitpos: [18]; default: 0;
 * Clear touch timeout interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_CLR_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_CLR : WO; bitpos: [17]; default: 0;
 * Clear cocpu trap interrupt state
 */

#define RTC_CNTL_RTC_COCPU_TRAP_INT_CLR    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_CLR_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_CLR_V << RTC_CNTL_RTC_COCPU_TRAP_INT_CLR_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_CLR_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR : WO; bitpos: [16]; default: 0;
 * Clear RTC WDT interrupt state
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_CLR_S  16

/* RTC_CNTL_RTC_SWD_INT_CLR : WO; bitpos: [15]; default: 0;
 * Clear super watch dog interrupt state
 */

#define RTC_CNTL_RTC_SWD_INT_CLR    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_CLR_M  (RTC_CNTL_RTC_SWD_INT_CLR_V << RTC_CNTL_RTC_SWD_INT_CLR_S)
#define RTC_CNTL_RTC_SWD_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_CLR_S  15

/* RTC_CNTL_RTC_SARADC2_INT_CLR : WO; bitpos: [14]; default: 0;
 * Clear saradc2 interrupt state
 */

#define RTC_CNTL_RTC_SARADC2_INT_CLR    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_CLR_M  (RTC_CNTL_RTC_SARADC2_INT_CLR_V << RTC_CNTL_RTC_SARADC2_INT_CLR_S)
#define RTC_CNTL_RTC_SARADC2_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_CLR_S  14

/* RTC_CNTL_RTC_COCPU_INT_CLR : WO; bitpos: [13]; default: 0;
 * Clear riscV cocpu interrupt state
 */

#define RTC_CNTL_RTC_COCPU_INT_CLR    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_CLR_M  (RTC_CNTL_RTC_COCPU_INT_CLR_V << RTC_CNTL_RTC_COCPU_INT_CLR_S)
#define RTC_CNTL_RTC_COCPU_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_CLR_S  13

/* RTC_CNTL_RTC_TSENS_INT_CLR : WO; bitpos: [12]; default: 0;
 * Clear tsens interrupt state
 */

#define RTC_CNTL_RTC_TSENS_INT_CLR    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_CLR_M  (RTC_CNTL_RTC_TSENS_INT_CLR_V << RTC_CNTL_RTC_TSENS_INT_CLR_S)
#define RTC_CNTL_RTC_TSENS_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_CLR_S  12

/* RTC_CNTL_RTC_SARADC1_INT_CLR : WO; bitpos: [11]; default: 0;
 * Clear saradc1 interrupt state
 */

#define RTC_CNTL_RTC_SARADC1_INT_CLR    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_CLR_M  (RTC_CNTL_RTC_SARADC1_INT_CLR_V << RTC_CNTL_RTC_SARADC1_INT_CLR_S)
#define RTC_CNTL_RTC_SARADC1_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_CLR_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_CLR : WO; bitpos: [10]; default: 0;
 * Clear RTC main timer interrupt state
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_CLR    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_CLR_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_CLR_V << RTC_CNTL_RTC_MAIN_TIMER_INT_CLR_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_CLR_S  10

/* RTC_CNTL_RTC_BROWN_OUT_INT_CLR : WO; bitpos: [9]; default: 0;
 * Clear brown out interrupt state
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_CLR    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_CLR_M  (RTC_CNTL_RTC_BROWN_OUT_INT_CLR_V << RTC_CNTL_RTC_BROWN_OUT_INT_CLR_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_CLR_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR : WO; bitpos: [8]; default: 0;
 * Clear touch inactive interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_CLR_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR : WO; bitpos: [7]; default: 0;
 * Clear touch active interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_CLR_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_CLR : WO; bitpos: [6]; default: 0;
 * Clear touch done interrupt state
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_CLR    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_CLR_V << RTC_CNTL_RTC_TOUCH_DONE_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_CLR_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_CLR : WO; bitpos: [5]; default: 0;
 * Clear ULP-coprocessor interrupt state
 */

#define RTC_CNTL_RTC_ULP_CP_INT_CLR    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_CLR_M  (RTC_CNTL_RTC_ULP_CP_INT_CLR_V << RTC_CNTL_RTC_ULP_CP_INT_CLR_S)
#define RTC_CNTL_RTC_ULP_CP_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_CLR_S  5

/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR : WO; bitpos: [4]; default: 0;
 * clear touch scan done interrupt raw
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_CLR_S  4

/* RTC_CNTL_RTC_WDT_INT_CLR : WO; bitpos: [3]; default: 0;
 * Clear RTC WDT interrupt state
 */

#define RTC_CNTL_RTC_WDT_INT_CLR    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_CLR_M  (RTC_CNTL_RTC_WDT_INT_CLR_V << RTC_CNTL_RTC_WDT_INT_CLR_S)
#define RTC_CNTL_RTC_WDT_INT_CLR_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_CLR_S  3

/* RTC_CNTL_SDIO_IDLE_INT_CLR : WO; bitpos: [2]; default: 0;
 * Clear SDIO idle interrupt state
 */

#define RTC_CNTL_SDIO_IDLE_INT_CLR    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_CLR_M  (RTC_CNTL_SDIO_IDLE_INT_CLR_V << RTC_CNTL_SDIO_IDLE_INT_CLR_S)
#define RTC_CNTL_SDIO_IDLE_INT_CLR_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_CLR_S  2

/* RTC_CNTL_SLP_REJECT_INT_CLR : WO; bitpos: [1]; default: 0;
 * Clear sleep reject interrupt state
 */

#define RTC_CNTL_SLP_REJECT_INT_CLR    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_CLR_M  (RTC_CNTL_SLP_REJECT_INT_CLR_V << RTC_CNTL_SLP_REJECT_INT_CLR_S)
#define RTC_CNTL_SLP_REJECT_INT_CLR_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_CLR_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_CLR : WO; bitpos: [0]; default: 0;
 * Clear sleep wakeup interrupt state
 */

#define RTC_CNTL_SLP_WAKEUP_INT_CLR    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_M  (RTC_CNTL_SLP_WAKEUP_INT_CLR_V << RTC_CNTL_SLP_WAKEUP_INT_CLR_S)
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_CLR_S  0

/* RTC_CNTL_RTC_STORE0_REG register
 * Reserved register
 */

