apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_RTC_PD_EN    (BIT(20))
#define RTC_CNTL_RTC_PD_EN_M  (RTC_CNTL_RTC_PD_EN_V << RTC_CNTL_RTC_PD_EN_S)
#define RTC_CNTL_RTC_PD_EN_V  0x00000001
#define RTC_CNTL_RTC_PD_EN_S  20

/* RTC_CNTL_RTC_FORCE_PU : R/W; bitpos: [19]; default: 0;
 * rtc_peri force power up
 */

#define RTC_CNTL_RTC_FORCE_PU    (BIT(19))
#define RTC_CNTL_RTC_FORCE_PU_M  (RTC_CNTL_RTC_FORCE_PU_V << RTC_CNTL_RTC_FORCE_PU_S)
#define RTC_CNTL_RTC_FORCE_PU_V  0x00000001
#define RTC_CNTL_RTC_FORCE_PU_S  19

/* RTC_CNTL_RTC_FORCE_PD : R/W; bitpos: [18]; default: 0;
 * rtc_peri force power down
 */

#define RTC_CNTL_RTC_FORCE_PD    (BIT(18))
#define RTC_CNTL_RTC_FORCE_PD_M  (RTC_CNTL_RTC_FORCE_PD_V << RTC_CNTL_RTC_FORCE_PD_S)
#define RTC_CNTL_RTC_FORCE_PD_V  0x00000001
#define RTC_CNTL_RTC_FORCE_PD_S  18

/* RTC_CNTL_RTC_SLOWMEM_FORCE_LPU : R/W; bitpos: [11]; default: 1;
 * RTC memory force no PD
 */

#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPU    (BIT(11))
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPU_M  (RTC_CNTL_RTC_SLOWMEM_FORCE_LPU_V << RTC_CNTL_RTC_SLOWMEM_FORCE_LPU_S)
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPU_V  0x00000001
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPU_S  11

/* RTC_CNTL_RTC_SLOWMEM_FORCE_LPD : R/W; bitpos: [10]; default: 0;
 * RTC memory force PD
 */

#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPD    (BIT(10))
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPD_M  (RTC_CNTL_RTC_SLOWMEM_FORCE_LPD_V << RTC_CNTL_RTC_SLOWMEM_FORCE_LPD_S)
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPD_V  0x00000001
#define RTC_CNTL_RTC_SLOWMEM_FORCE_LPD_S  10

/* RTC_CNTL_RTC_SLOWMEM_FOLW_CPU : R/W; bitpos: [9]; default: 0;
 * 1: RTC memory  PD following CPU, 0: RTC memory PD following RTC state
 * machine
 */

#define RTC_CNTL_RTC_SLOWMEM_FOLW_CPU    (BIT(9))
#define RTC_CNTL_RTC_SLOWMEM_FOLW_CPU_M  (RTC_CNTL_RTC_SLOWMEM_FOLW_CPU_V << RTC_CNTL_RTC_SLOWMEM_FOLW_CPU_S)
#define RTC_CNTL_RTC_SLOWMEM_FOLW_CPU_V  0x00000001
#define RTC_CNTL_RTC_SLOWMEM_FOLW_CPU_S  9

/* RTC_CNTL_RTC_FASTMEM_FORCE_LPU : R/W; bitpos: [8]; default: 1;
 * Fast RTC memory force no PD
 */

#define RTC_CNTL_RTC_FASTMEM_FORCE_LPU    (BIT(8))
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPU_M  (RTC_CNTL_RTC_FASTMEM_FORCE_LPU_V << RTC_CNTL_RTC_FASTMEM_FORCE_LPU_S)
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPU_V  0x00000001
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPU_S  8

/* RTC_CNTL_RTC_FASTMEM_FORCE_LPD : R/W; bitpos: [7]; default: 0;
 * Fast RTC memory force PD
 */

#define RTC_CNTL_RTC_FASTMEM_FORCE_LPD    (BIT(7))
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPD_M  (RTC_CNTL_RTC_FASTMEM_FORCE_LPD_V << RTC_CNTL_RTC_FASTMEM_FORCE_LPD_S)
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPD_V  0x00000001
#define RTC_CNTL_RTC_FASTMEM_FORCE_LPD_S  7

/* RTC_CNTL_RTC_FASTMEM_FOLW_CPU : R/W; bitpos: [6]; default: 0;
 * 1: Fast RTC memory PD following CPU, 0: fast RTC memory PD following RTC
 * state machine
 */

#define RTC_CNTL_RTC_FASTMEM_FOLW_CPU    (BIT(6))
#define RTC_CNTL_RTC_FASTMEM_FOLW_CPU_M  (RTC_CNTL_RTC_FASTMEM_FOLW_CPU_V << RTC_CNTL_RTC_FASTMEM_FOLW_CPU_S)
#define RTC_CNTL_RTC_FASTMEM_FOLW_CPU_V  0x00000001
#define RTC_CNTL_RTC_FASTMEM_FOLW_CPU_S  6

/* RTC_CNTL_RTC_FORCE_NOISO : R/W; bitpos: [5]; default: 1;
 * rtc_peri force no ISO
 */

#define RTC_CNTL_RTC_FORCE_NOISO    (BIT(5))
#define RTC_CNTL_RTC_FORCE_NOISO_M  (RTC_CNTL_RTC_FORCE_NOISO_V << RTC_CNTL_RTC_FORCE_NOISO_S)
#define RTC_CNTL_RTC_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_RTC_FORCE_NOISO_S  5

/* RTC_CNTL_RTC_FORCE_ISO : R/W; bitpos: [4]; default: 0;
 * rtc_peri force ISO
 */

#define RTC_CNTL_RTC_FORCE_ISO    (BIT(4))
#define RTC_CNTL_RTC_FORCE_ISO_M  (RTC_CNTL_RTC_FORCE_ISO_V << RTC_CNTL_RTC_FORCE_ISO_S)
#define RTC_CNTL_RTC_FORCE_ISO_V  0x00000001
#define RTC_CNTL_RTC_FORCE_ISO_S  4

/* RTC_CNTL_RTC_SLOWMEM_FORCE_ISO : R/W; bitpos: [3]; default: 0;
 * RTC memory force ISO
 */

#define RTC_CNTL_RTC_SLOWMEM_FORCE_ISO    (BIT(3))
#define RTC_CNTL_RTC_SLOWMEM_FORCE_ISO_M  (RTC_CNTL_RTC_SLOWMEM_FORCE_ISO_V << RTC_CNTL_RTC_SLOWMEM_FORCE_ISO_S)
#define RTC_CNTL_RTC_SLOWMEM_FORCE_ISO_V  0x00000001
#define RTC_CNTL_RTC_SLOWMEM_FORCE_ISO_S  3

/* RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO : R/W; bitpos: [2]; default: 1;
 * RTC memory force no ISO
 */

#define RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO    (BIT(2))
#define RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO_M  (RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO_V << RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO_S)
#define RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_RTC_SLOWMEM_FORCE_NOISO_S  2

/* RTC_CNTL_RTC_FASTMEM_FORCE_ISO : R/W; bitpos: [1]; default: 0;
 * Fast RTC memory force ISO
 */

#define RTC_CNTL_RTC_FASTMEM_FORCE_ISO    (BIT(1))
#define RTC_CNTL_RTC_FASTMEM_FORCE_ISO_M  (RTC_CNTL_RTC_FASTMEM_FORCE_ISO_V << RTC_CNTL_RTC_FASTMEM_FORCE_ISO_S)
#define RTC_CNTL_RTC_FASTMEM_FORCE_ISO_V  0x00000001
#define RTC_CNTL_RTC_FASTMEM_FORCE_ISO_S  1

/* RTC_CNTL_RTC_FASTMEM_FORCE_NOISO : R/W; bitpos: [0]; default: 1;
 * Fast RTC memory force no ISO
 */

#define RTC_CNTL_RTC_FASTMEM_FORCE_NOISO    (BIT(0))
#define RTC_CNTL_RTC_FASTMEM_FORCE_NOISO_M  (RTC_CNTL_RTC_FASTMEM_FORCE_NOISO_V << RTC_CNTL_RTC_FASTMEM_FORCE_NOISO_S)
#define RTC_CNTL_RTC_FASTMEM_FORCE_NOISO_V  0x00000001
#define RTC_CNTL_RTC_FASTMEM_FORCE_NOISO_S  0

/* RTC_CNTL_RTC_REGULATOR_DRV_CTRL_REG register
 * No public
 */

#define RTC_CNTL_RTC_REGULATOR_DRV_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x8c)

/* RTC_CNTL_DG_VDD_DRV_B_MONITOR : R/W; bitpos: [27:20]; default: 0;
 * No public
 */

#define RTC_CNTL_DG_VDD_DRV_B_MONITOR    0x000000ff
#define RTC_CNTL_DG_VDD_DRV_B_MONITOR_M  (RTC_CNTL_DG_VDD_DRV_B_MONITOR_V << RTC_CNTL_DG_VDD_DRV_B_MONITOR_S)
#define RTC_CNTL_DG_VDD_DRV_B_MONITOR_V  0x000000ff
#define RTC_CNTL_DG_VDD_DRV_B_MONITOR_S  20

/* RTC_CNTL_DG_VDD_DRV_B_SLP : R/W; bitpos: [19:12]; default: 0;
 * No public
 */

#define RTC_CNTL_DG_VDD_DRV_B_SLP    0x000000ff
#define RTC_CNTL_DG_VDD_DRV_B_SLP_M  (RTC_CNTL_DG_VDD_DRV_B_SLP_V << RTC_CNTL_DG_VDD_DRV_B_SLP_S)
#define RTC_CNTL_DG_VDD_DRV_B_SLP_V  0x000000ff
#define RTC_CNTL_DG_VDD_DRV_B_SLP_S  12

/* RTC_CNTL_RTC_REGULATOR_DRV_B_SLP : R/W; bitpos: [11:6]; default: 0;
 * No public
 */

#define RTC_CNTL_RTC_REGULATOR_DRV_B_SLP    0x0000003f
#define RTC_CNTL_RTC_REGULATOR_DRV_B_SLP_M  (RTC_CNTL_RTC_REGULATOR_DRV_B_SLP_V << RTC_CNTL_RTC_REGULATOR_DRV_B_SLP_S)
#define RTC_CNTL_RTC_REGULATOR_DRV_B_SLP_V  0x0000003f
#define RTC_CNTL_RTC_REGULATOR_DRV_B_SLP_S  6

/* RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR : R/W; bitpos: [5:0]; default: 0;
 * No public
 */

#define RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR    0x0000003f
#define RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR_M  (RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR_V << RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR_S)
#define RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR_V  0x0000003f
#define RTC_CNTL_RTC_REGULATOR_DRV_B_MONITOR_S  0

/* RTC_CNTL_DIG_PWC_REG register
 * configure digital power
 */

#define RTC_CNTL_DIG_PWC_REG (DR_REG_RTCCNTL_BASE + 0x90)

