apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_SWD_FEED : WO; bitpos: [29]; default: 0;
 * Sw feed swd
 */

#define RTC_CNTL_SWD_FEED    (BIT(29))
#define RTC_CNTL_SWD_FEED_M  (RTC_CNTL_SWD_FEED_V << RTC_CNTL_SWD_FEED_S)
#define RTC_CNTL_SWD_FEED_V  0x00000001
#define RTC_CNTL_SWD_FEED_S  29

/* RTC_CNTL_SWD_RST_FLAG_CLR : WO; bitpos: [28]; default: 0;
 * reset swd reset flag
 */

#define RTC_CNTL_SWD_RST_FLAG_CLR    (BIT(28))
#define RTC_CNTL_SWD_RST_FLAG_CLR_M  (RTC_CNTL_SWD_RST_FLAG_CLR_V << RTC_CNTL_SWD_RST_FLAG_CLR_S)
#define RTC_CNTL_SWD_RST_FLAG_CLR_V  0x00000001
#define RTC_CNTL_SWD_RST_FLAG_CLR_S  28

/* RTC_CNTL_SWD_SIGNAL_WIDTH : R/W; bitpos: [27:18]; default: 300;
 * adjust signal width send to swd
 */

#define RTC_CNTL_SWD_SIGNAL_WIDTH    0x000003ff
#define RTC_CNTL_SWD_SIGNAL_WIDTH_M  (RTC_CNTL_SWD_SIGNAL_WIDTH_V << RTC_CNTL_SWD_SIGNAL_WIDTH_S)
#define RTC_CNTL_SWD_SIGNAL_WIDTH_V  0x000003ff
#define RTC_CNTL_SWD_SIGNAL_WIDTH_S  18

/* RTC_CNTL_SWD_BYPASS_RST : R/W; bitpos: [17]; default: 0;
 * bypass super watch dog reset
 */

#define RTC_CNTL_SWD_BYPASS_RST    (BIT(17))
#define RTC_CNTL_SWD_BYPASS_RST_M  (RTC_CNTL_SWD_BYPASS_RST_V << RTC_CNTL_SWD_BYPASS_RST_S)
#define RTC_CNTL_SWD_BYPASS_RST_V  0x00000001
#define RTC_CNTL_SWD_BYPASS_RST_S  17

/* RTC_CNTL_SWD_FEED_INT : RO; bitpos: [1]; default: 0;
 * swd interrupt for feeding
 */

#define RTC_CNTL_SWD_FEED_INT    (BIT(1))
#define RTC_CNTL_SWD_FEED_INT_M  (RTC_CNTL_SWD_FEED_INT_V << RTC_CNTL_SWD_FEED_INT_S)
#define RTC_CNTL_SWD_FEED_INT_V  0x00000001
#define RTC_CNTL_SWD_FEED_INT_S  1

/* RTC_CNTL_SWD_RESET_FLAG : RO; bitpos: [0]; default: 0;
 * swd reset flag
 */

#define RTC_CNTL_SWD_RESET_FLAG    (BIT(0))
#define RTC_CNTL_SWD_RESET_FLAG_M  (RTC_CNTL_SWD_RESET_FLAG_V << RTC_CNTL_SWD_RESET_FLAG_S)
#define RTC_CNTL_SWD_RESET_FLAG_V  0x00000001
#define RTC_CNTL_SWD_RESET_FLAG_S  0

/* RTC_CNTL_RTC_SWD_WPROTECT_REG register
 * super watch dog key
 */

#define RTC_CNTL_RTC_SWD_WPROTECT_REG (DR_REG_RTCCNTL_BASE + 0xb8)

/* RTC_CNTL_SWD_WKEY : R/W; bitpos: [31:0]; default: 2401055018;
 * super watch dog key
 */

#define RTC_CNTL_SWD_WKEY    0xffffffff
#define RTC_CNTL_SWD_WKEY_M  (RTC_CNTL_SWD_WKEY_V << RTC_CNTL_SWD_WKEY_S)
#define RTC_CNTL_SWD_WKEY_V  0xffffffff
#define RTC_CNTL_SWD_WKEY_S  0

/* RTC_CNTL_RTC_SW_CPU_STALL_REG register
 * configure cpu stall by sw
 */

#define RTC_CNTL_RTC_SW_CPU_STALL_REG (DR_REG_RTCCNTL_BASE + 0xbc)

/* RTC_CNTL_SW_STALL_PROCPU_C1 : R/W; bitpos: [31:26]; default: 0;
 * {reg_sw_stall_appcpu_c1[5:0],  reg_sw_stall_appcpu_c0[1:0]} == 0x86 will
 * stall APP CPU
 */

#define RTC_CNTL_SW_STALL_PROCPU_C1    0x0000003f
#define RTC_CNTL_SW_STALL_PROCPU_C1_M  (RTC_CNTL_SW_STALL_PROCPU_C1_V << RTC_CNTL_SW_STALL_PROCPU_C1_S)
#define RTC_CNTL_SW_STALL_PROCPU_C1_V  0x0000003f
#define RTC_CNTL_SW_STALL_PROCPU_C1_S  26

/* RTC_CNTL_SW_STALL_APPCPU_C1 : R/W; bitpos: [25:20]; default: 0;
 * {reg_sw_stall_appcpu_c1[5:0],  reg_sw_stall_appcpu_c0[1:0]} == 0x86 will
 * stall APP CPU
 */

#define RTC_CNTL_SW_STALL_APPCPU_C1    0x0000003f
#define RTC_CNTL_SW_STALL_APPCPU_C1_M  (RTC_CNTL_SW_STALL_APPCPU_C1_V << RTC_CNTL_SW_STALL_APPCPU_C1_S)
#define RTC_CNTL_SW_STALL_APPCPU_C1_V  0x0000003f
#define RTC_CNTL_SW_STALL_APPCPU_C1_S  20

/* RTC_CNTL_RTC_STORE4_REG register
 * reserved register
 */

#define RTC_CNTL_RTC_STORE4_REG (DR_REG_RTCCNTL_BASE + 0xc0)

/* RTC_CNTL_RTC_SCRATCH4 : R/W; bitpos: [31:0]; default: 0;
 * reserved register
 */

#define RTC_CNTL_RTC_SCRATCH4    0xffffffff
#define RTC_CNTL_RTC_SCRATCH4_M  (RTC_CNTL_RTC_SCRATCH4_V << RTC_CNTL_RTC_SCRATCH4_S)
#define RTC_CNTL_RTC_SCRATCH4_V  0xffffffff
#define RTC_CNTL_RTC_SCRATCH4_S  0

/* RTC_CNTL_RTC_STORE5_REG register
 * reserved register
 */

#define RTC_CNTL_RTC_STORE5_REG (DR_REG_RTCCNTL_BASE + 0xc4)

/* RTC_CNTL_RTC_SCRATCH5 : R/W; bitpos: [31:0]; default: 0;
 * reserved register
 */

#define RTC_CNTL_RTC_SCRATCH5    0xffffffff
#define RTC_CNTL_RTC_SCRATCH5_M  (RTC_CNTL_RTC_SCRATCH5_V << RTC_CNTL_RTC_SCRATCH5_S)
#define RTC_CNTL_RTC_SCRATCH5_V  0xffffffff
#define RTC_CNTL_RTC_SCRATCH5_S  0

/* RTC_CNTL_RTC_STORE6_REG register
 * reserved register
 */

#define RTC_CNTL_RTC_STORE6_REG (DR_REG_RTCCNTL_BASE + 0xc8)

/* RTC_CNTL_RTC_SCRATCH6 : R/W; bitpos: [31:0]; default: 0;
 * reserved register
 */

#define RTC_CNTL_RTC_SCRATCH6    0xffffffff
#define RTC_CNTL_RTC_SCRATCH6_M  (RTC_CNTL_RTC_SCRATCH6_V << RTC_CNTL_RTC_SCRATCH6_S)
#define RTC_CNTL_RTC_SCRATCH6_V  0xffffffff
#define RTC_CNTL_RTC_SCRATCH6_S  0

/* RTC_CNTL_RTC_STORE7_REG register
 * reserved register
 */

#define RTC_CNTL_RTC_STORE7_REG (DR_REG_RTCCNTL_BASE + 0xcc)

/* RTC_CNTL_RTC_SCRATCH7 : R/W; bitpos: [31:0]; default: 0;
 * reserved register
 */

#define RTC_CNTL_RTC_SCRATCH7    0xffffffff
#define RTC_CNTL_RTC_SCRATCH7_M  (RTC_CNTL_RTC_SCRATCH7_V << RTC_CNTL_RTC_SCRATCH7_S)
#define RTC_CNTL_RTC_SCRATCH7_V  0xffffffff
#define RTC_CNTL_RTC_SCRATCH7_S  0

/* RTC_CNTL_RTC_LOW_POWER_ST_REG register
 * reserved register
 */

#define RTC_CNTL_RTC_LOW_POWER_ST_REG (DR_REG_RTCCNTL_BASE + 0xd0)

/* RTC_CNTL_RTC_MAIN_STATE : RO; bitpos: [31:28]; default: 0;
 * rtc main state machine status
 */

#define RTC_CNTL_RTC_MAIN_STATE    0x0000000f
#define RTC_CNTL_RTC_MAIN_STATE_M  (RTC_CNTL_RTC_MAIN_STATE_V << RTC_CNTL_RTC_MAIN_STATE_S)
#define RTC_CNTL_RTC_MAIN_STATE_V  0x0000000f
#define RTC_CNTL_RTC_MAIN_STATE_S  28

/* RTC_CNTL_RTC_MAIN_STATE_IN_IDLE : RO; bitpos: [27]; default: 0;
 * rtc main state machine is in idle state
 */

#define RTC_CNTL_RTC_MAIN_STATE_IN_IDLE    (BIT(27))
#define RTC_CNTL_RTC_MAIN_STATE_IN_IDLE_M  (RTC_CNTL_RTC_MAIN_STATE_IN_IDLE_V << RTC_CNTL_RTC_MAIN_STATE_IN_IDLE_S)
#define RTC_CNTL_RTC_MAIN_STATE_IN_IDLE_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_IN_IDLE_S  27

/* RTC_CNTL_RTC_MAIN_STATE_IN_SLP : RO; bitpos: [26]; default: 0;
 * rtc main state machine is in sleep state
 */

#define RTC_CNTL_RTC_MAIN_STATE_IN_SLP    (BIT(26))
#define RTC_CNTL_RTC_MAIN_STATE_IN_SLP_M  (RTC_CNTL_RTC_MAIN_STATE_IN_SLP_V << RTC_CNTL_RTC_MAIN_STATE_IN_SLP_S)
#define RTC_CNTL_RTC_MAIN_STATE_IN_SLP_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_IN_SLP_S  26

