apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL : RO; bitpos: [25]; default: 0;
 * rtc main state machine is in wait xtal state
 */

#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL    (BIT(25))
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL_M  (RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL_V << RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL_S)
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_XTL_S  25

/* RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL : RO; bitpos: [24]; default: 0;
 * rtc main state machine is in wait pll state
 */

#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL    (BIT(24))
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL_M  (RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL_V << RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL_S)
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_PLL_S  24

/* RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M : RO; bitpos: [23]; default: 0;
 * rtc main state machine is in wait 8m state
 */

#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M    (BIT(23))
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M_M  (RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M_V << RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M_S)
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_IN_WAIT_8M_S  23

/* RTC_CNTL_RTC_IN_LOW_POWER_STATE : RO; bitpos: [22]; default: 0;
 * rtc main state machine is in the states of low power
 */

#define RTC_CNTL_RTC_IN_LOW_POWER_STATE    (BIT(22))
#define RTC_CNTL_RTC_IN_LOW_POWER_STATE_M  (RTC_CNTL_RTC_IN_LOW_POWER_STATE_V << RTC_CNTL_RTC_IN_LOW_POWER_STATE_S)
#define RTC_CNTL_RTC_IN_LOW_POWER_STATE_V  0x00000001
#define RTC_CNTL_RTC_IN_LOW_POWER_STATE_S  22

/* RTC_CNTL_RTC_IN_WAKEUP_STATE : RO; bitpos: [21]; default: 0;
 * rtc main state machine is in the states of wakeup process
 */

#define RTC_CNTL_RTC_IN_WAKEUP_STATE    (BIT(21))
#define RTC_CNTL_RTC_IN_WAKEUP_STATE_M  (RTC_CNTL_RTC_IN_WAKEUP_STATE_V << RTC_CNTL_RTC_IN_WAKEUP_STATE_S)
#define RTC_CNTL_RTC_IN_WAKEUP_STATE_V  0x00000001
#define RTC_CNTL_RTC_IN_WAKEUP_STATE_S  21

/* RTC_CNTL_RTC_MAIN_STATE_WAIT_END : RO; bitpos: [20]; default: 0;
 * rtc main state machine has been waited for some cycles
 */

#define RTC_CNTL_RTC_MAIN_STATE_WAIT_END    (BIT(20))
#define RTC_CNTL_RTC_MAIN_STATE_WAIT_END_M  (RTC_CNTL_RTC_MAIN_STATE_WAIT_END_V << RTC_CNTL_RTC_MAIN_STATE_WAIT_END_S)
#define RTC_CNTL_RTC_MAIN_STATE_WAIT_END_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_WAIT_END_S  20

/* RTC_CNTL_RTC_RDY_FOR_WAKEUP : RO; bitpos: [19]; default: 0;
 * rtc is ready to receive wake up trigger from wake up source
 */

#define RTC_CNTL_RTC_RDY_FOR_WAKEUP    (BIT(19))
#define RTC_CNTL_RTC_RDY_FOR_WAKEUP_M  (RTC_CNTL_RTC_RDY_FOR_WAKEUP_V << RTC_CNTL_RTC_RDY_FOR_WAKEUP_S)
#define RTC_CNTL_RTC_RDY_FOR_WAKEUP_V  0x00000001
#define RTC_CNTL_RTC_RDY_FOR_WAKEUP_S  19

/* RTC_CNTL_RTC_MAIN_STATE_PLL_ON : RO; bitpos: [18]; default: 0;
 * rtc main state machine is in states that pll should be running
 */

#define RTC_CNTL_RTC_MAIN_STATE_PLL_ON    (BIT(18))
#define RTC_CNTL_RTC_MAIN_STATE_PLL_ON_M  (RTC_CNTL_RTC_MAIN_STATE_PLL_ON_V << RTC_CNTL_RTC_MAIN_STATE_PLL_ON_S)
#define RTC_CNTL_RTC_MAIN_STATE_PLL_ON_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_PLL_ON_S  18

/* RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO : RO; bitpos: [17]; default: 0;
 * no use any more
 */

#define RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO    (BIT(17))
#define RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO_M  (RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO_V << RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO_S)
#define RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO_V  0x00000001
#define RTC_CNTL_RTC_MAIN_STATE_XTAL_ISO_S  17

/* RTC_CNTL_RTC_COCPU_STATE_DONE : RO; bitpos: [16]; default: 0;
 * ulp/cocpu is done
 */

#define RTC_CNTL_RTC_COCPU_STATE_DONE    (BIT(16))
#define RTC_CNTL_RTC_COCPU_STATE_DONE_M  (RTC_CNTL_RTC_COCPU_STATE_DONE_V << RTC_CNTL_RTC_COCPU_STATE_DONE_S)
#define RTC_CNTL_RTC_COCPU_STATE_DONE_V  0x00000001
#define RTC_CNTL_RTC_COCPU_STATE_DONE_S  16

/* RTC_CNTL_RTC_COCPU_STATE_SLP : RO; bitpos: [15]; default: 0;
 * ulp/cocpu is in sleep state
 */

#define RTC_CNTL_RTC_COCPU_STATE_SLP    (BIT(15))
#define RTC_CNTL_RTC_COCPU_STATE_SLP_M  (RTC_CNTL_RTC_COCPU_STATE_SLP_V << RTC_CNTL_RTC_COCPU_STATE_SLP_S)
#define RTC_CNTL_RTC_COCPU_STATE_SLP_V  0x00000001
#define RTC_CNTL_RTC_COCPU_STATE_SLP_S  15

/* RTC_CNTL_RTC_COCPU_STATE_SWITCH : RO; bitpos: [14]; default: 0;
 * ulp/cocpu is about to working. Switch rtc main state
 */

#define RTC_CNTL_RTC_COCPU_STATE_SWITCH    (BIT(14))
#define RTC_CNTL_RTC_COCPU_STATE_SWITCH_M  (RTC_CNTL_RTC_COCPU_STATE_SWITCH_V << RTC_CNTL_RTC_COCPU_STATE_SWITCH_S)
#define RTC_CNTL_RTC_COCPU_STATE_SWITCH_V  0x00000001
#define RTC_CNTL_RTC_COCPU_STATE_SWITCH_S  14

/* RTC_CNTL_RTC_COCPU_STATE_START : RO; bitpos: [13]; default: 0;
 * ulp/cocpu should start to work
 */

#define RTC_CNTL_RTC_COCPU_STATE_START    (BIT(13))
#define RTC_CNTL_RTC_COCPU_STATE_START_M  (RTC_CNTL_RTC_COCPU_STATE_START_V << RTC_CNTL_RTC_COCPU_STATE_START_S)
#define RTC_CNTL_RTC_COCPU_STATE_START_V  0x00000001
#define RTC_CNTL_RTC_COCPU_STATE_START_S  13

/* RTC_CNTL_RTC_TOUCH_STATE_DONE : RO; bitpos: [12]; default: 0;
 * touch is done
 */

#define RTC_CNTL_RTC_TOUCH_STATE_DONE    (BIT(12))
#define RTC_CNTL_RTC_TOUCH_STATE_DONE_M  (RTC_CNTL_RTC_TOUCH_STATE_DONE_V << RTC_CNTL_RTC_TOUCH_STATE_DONE_S)
#define RTC_CNTL_RTC_TOUCH_STATE_DONE_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_STATE_DONE_S  12

/* RTC_CNTL_RTC_TOUCH_STATE_SLP : RO; bitpos: [11]; default: 0;
 * touch is in sleep state
 */

#define RTC_CNTL_RTC_TOUCH_STATE_SLP    (BIT(11))
#define RTC_CNTL_RTC_TOUCH_STATE_SLP_M  (RTC_CNTL_RTC_TOUCH_STATE_SLP_V << RTC_CNTL_RTC_TOUCH_STATE_SLP_S)
#define RTC_CNTL_RTC_TOUCH_STATE_SLP_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_STATE_SLP_S  11

/* RTC_CNTL_RTC_TOUCH_STATE_SWITCH : RO; bitpos: [10]; default: 0;
 * touch is about to working. Switch rtc main state
 */

#define RTC_CNTL_RTC_TOUCH_STATE_SWITCH    (BIT(10))
#define RTC_CNTL_RTC_TOUCH_STATE_SWITCH_M  (RTC_CNTL_RTC_TOUCH_STATE_SWITCH_V << RTC_CNTL_RTC_TOUCH_STATE_SWITCH_S)
#define RTC_CNTL_RTC_TOUCH_STATE_SWITCH_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_STATE_SWITCH_S  10

/* RTC_CNTL_RTC_TOUCH_STATE_START : RO; bitpos: [9]; default: 0;
 * touch should start to work
 */

#define RTC_CNTL_RTC_TOUCH_STATE_START    (BIT(9))
#define RTC_CNTL_RTC_TOUCH_STATE_START_M  (RTC_CNTL_RTC_TOUCH_STATE_START_V << RTC_CNTL_RTC_TOUCH_STATE_START_S)
#define RTC_CNTL_RTC_TOUCH_STATE_START_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_STATE_START_S  9

/* RTC_CNTL_XPD_DIG : RO; bitpos: [8]; default: 0;
 * digital wrap power down
 */

