apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_ULP_CP_PC_INIT : R/W; bitpos: [10:0]; default: 0;
 * ULP-coprocessor PC initial address
 */

#define RTC_CNTL_ULP_CP_PC_INIT    0x000007ff
#define RTC_CNTL_ULP_CP_PC_INIT_M  (RTC_CNTL_ULP_CP_PC_INIT_V << RTC_CNTL_ULP_CP_PC_INIT_S)
#define RTC_CNTL_ULP_CP_PC_INIT_V  0x000007ff
#define RTC_CNTL_ULP_CP_PC_INIT_S  0

/* RTC_CNTL_RTC_ULP_CP_CTRL_REG register
 * configure ulp
 */

#define RTC_CNTL_RTC_ULP_CP_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x100)

/* RTC_CNTL_ULP_CP_START_TOP : R/W; bitpos: [31]; default: 0;
 * Write 1 to start ULP-coprocessor
 */

#define RTC_CNTL_ULP_CP_START_TOP    (BIT(31))
#define RTC_CNTL_ULP_CP_START_TOP_M  (RTC_CNTL_ULP_CP_START_TOP_V << RTC_CNTL_ULP_CP_START_TOP_S)
#define RTC_CNTL_ULP_CP_START_TOP_V  0x00000001
#define RTC_CNTL_ULP_CP_START_TOP_S  31

/* RTC_CNTL_ULP_CP_FORCE_START_TOP : R/W; bitpos: [30]; default: 0;
 * 1: ULP-coprocessor is started by SW
 */

#define RTC_CNTL_ULP_CP_FORCE_START_TOP    (BIT(30))
#define RTC_CNTL_ULP_CP_FORCE_START_TOP_M  (RTC_CNTL_ULP_CP_FORCE_START_TOP_V << RTC_CNTL_ULP_CP_FORCE_START_TOP_S)
#define RTC_CNTL_ULP_CP_FORCE_START_TOP_V  0x00000001
#define RTC_CNTL_ULP_CP_FORCE_START_TOP_S  30

/* RTC_CNTL_ULP_CP_RESET : R/W; bitpos: [29]; default: 0;
 * ulp coprocessor clk software reset
 */

#define RTC_CNTL_ULP_CP_RESET    (BIT(29))
#define RTC_CNTL_ULP_CP_RESET_M  (RTC_CNTL_ULP_CP_RESET_V << RTC_CNTL_ULP_CP_RESET_S)
#define RTC_CNTL_ULP_CP_RESET_V  0x00000001
#define RTC_CNTL_ULP_CP_RESET_S  29

/* RTC_CNTL_ULP_CP_CLK_FO : R/W; bitpos: [28]; default: 0;
 * ulp coprocessor clk force on
 */

#define RTC_CNTL_ULP_CP_CLK_FO    (BIT(28))
#define RTC_CNTL_ULP_CP_CLK_FO_M  (RTC_CNTL_ULP_CP_CLK_FO_V << RTC_CNTL_ULP_CP_CLK_FO_S)
#define RTC_CNTL_ULP_CP_CLK_FO_V  0x00000001
#define RTC_CNTL_ULP_CP_CLK_FO_S  28

/* RTC_CNTL_ULP_CP_MEM_OFFST_CLR : WO; bitpos: [22]; default: 0;
 * No public
 */

#define RTC_CNTL_ULP_CP_MEM_OFFST_CLR    (BIT(22))
#define RTC_CNTL_ULP_CP_MEM_OFFST_CLR_M  (RTC_CNTL_ULP_CP_MEM_OFFST_CLR_V << RTC_CNTL_ULP_CP_MEM_OFFST_CLR_S)
#define RTC_CNTL_ULP_CP_MEM_OFFST_CLR_V  0x00000001
#define RTC_CNTL_ULP_CP_MEM_OFFST_CLR_S  22

/* RTC_CNTL_ULP_CP_MEM_ADDR_SIZE : R/W; bitpos: [21:11]; default: 512;
 * No public
 */

#define RTC_CNTL_ULP_CP_MEM_ADDR_SIZE    0x000007ff
#define RTC_CNTL_ULP_CP_MEM_ADDR_SIZE_M  (RTC_CNTL_ULP_CP_MEM_ADDR_SIZE_V << RTC_CNTL_ULP_CP_MEM_ADDR_SIZE_S)
#define RTC_CNTL_ULP_CP_MEM_ADDR_SIZE_V  0x000007ff
#define RTC_CNTL_ULP_CP_MEM_ADDR_SIZE_S  11

/* RTC_CNTL_ULP_CP_MEM_ADDR_INIT : R/W; bitpos: [10:0]; default: 512;
 * No public
 */

#define RTC_CNTL_ULP_CP_MEM_ADDR_INIT    0x000007ff
#define RTC_CNTL_ULP_CP_MEM_ADDR_INIT_M  (RTC_CNTL_ULP_CP_MEM_ADDR_INIT_V << RTC_CNTL_ULP_CP_MEM_ADDR_INIT_S)
#define RTC_CNTL_ULP_CP_MEM_ADDR_INIT_V  0x000007ff
#define RTC_CNTL_ULP_CP_MEM_ADDR_INIT_S  0

/* RTC_CNTL_RTC_COCPU_CTRL_REG register
 * configure ulp-riscv
 */

#define RTC_CNTL_RTC_COCPU_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x104)

/* RTC_CNTL_COCPU_CLKGATE_EN : R/W; bitpos: [27]; default: 0;
 * open ulp-riscv clk gate
 */

#define RTC_CNTL_COCPU_CLKGATE_EN    (BIT(27))
#define RTC_CNTL_COCPU_CLKGATE_EN_M  (RTC_CNTL_COCPU_CLKGATE_EN_V << RTC_CNTL_COCPU_CLKGATE_EN_S)
#define RTC_CNTL_COCPU_CLKGATE_EN_V  0x00000001
#define RTC_CNTL_COCPU_CLKGATE_EN_S  27

/* RTC_CNTL_COCPU_SW_INT_TRIGGER : WO; bitpos: [26]; default: 0;
 * trigger cocpu register interrupt
 */

#define RTC_CNTL_COCPU_SW_INT_TRIGGER    (BIT(26))
#define RTC_CNTL_COCPU_SW_INT_TRIGGER_M  (RTC_CNTL_COCPU_SW_INT_TRIGGER_V << RTC_CNTL_COCPU_SW_INT_TRIGGER_S)
#define RTC_CNTL_COCPU_SW_INT_TRIGGER_V  0x00000001
#define RTC_CNTL_COCPU_SW_INT_TRIGGER_S  26

/* RTC_CNTL_COCPU_DONE : R/W; bitpos: [25]; default: 0;
 * done signal used by riscv to control timer.
 */

#define RTC_CNTL_COCPU_DONE    (BIT(25))
#define RTC_CNTL_COCPU_DONE_M  (RTC_CNTL_COCPU_DONE_V << RTC_CNTL_COCPU_DONE_S)
#define RTC_CNTL_COCPU_DONE_V  0x00000001
#define RTC_CNTL_COCPU_DONE_S  25

/* RTC_CNTL_COCPU_DONE_FORCE : R/W; bitpos: [24]; default: 0;
 * 1: select riscv done 0: select ulp done
 */

#define RTC_CNTL_COCPU_DONE_FORCE    (BIT(24))
#define RTC_CNTL_COCPU_DONE_FORCE_M  (RTC_CNTL_COCPU_DONE_FORCE_V << RTC_CNTL_COCPU_DONE_FORCE_S)
#define RTC_CNTL_COCPU_DONE_FORCE_V  0x00000001
#define RTC_CNTL_COCPU_DONE_FORCE_S  24

/* RTC_CNTL_COCPU_SEL : R/W; bitpos: [23]; default: 1;
 * 1: old ULP 0: new riscV
 */

#define RTC_CNTL_COCPU_SEL    (BIT(23))
#define RTC_CNTL_COCPU_SEL_M  (RTC_CNTL_COCPU_SEL_V << RTC_CNTL_COCPU_SEL_S)
#define RTC_CNTL_COCPU_SEL_V  0x00000001
#define RTC_CNTL_COCPU_SEL_S  23

/* RTC_CNTL_COCPU_SHUT_RESET_EN : R/W; bitpos: [22]; default: 0;
 * to reset cocpu
 */

#define RTC_CNTL_COCPU_SHUT_RESET_EN    (BIT(22))
#define RTC_CNTL_COCPU_SHUT_RESET_EN_M  (RTC_CNTL_COCPU_SHUT_RESET_EN_V << RTC_CNTL_COCPU_SHUT_RESET_EN_S)
#define RTC_CNTL_COCPU_SHUT_RESET_EN_V  0x00000001
#define RTC_CNTL_COCPU_SHUT_RESET_EN_S  22

/* RTC_CNTL_COCPU_SHUT_2_CLK_DIS : R/W; bitpos: [21:14]; default: 40;
 * time from shut cocpu to disable clk
 */

#define RTC_CNTL_COCPU_SHUT_2_CLK_DIS    0x000000ff
#define RTC_CNTL_COCPU_SHUT_2_CLK_DIS_M  (RTC_CNTL_COCPU_SHUT_2_CLK_DIS_V << RTC_CNTL_COCPU_SHUT_2_CLK_DIS_S)
#define RTC_CNTL_COCPU_SHUT_2_CLK_DIS_V  0x000000ff
#define RTC_CNTL_COCPU_SHUT_2_CLK_DIS_S  14

/* RTC_CNTL_COCPU_SHUT : R/W; bitpos: [13]; default: 0;
 * to shut cocpu
 */

#define RTC_CNTL_COCPU_SHUT    (BIT(13))
#define RTC_CNTL_COCPU_SHUT_M  (RTC_CNTL_COCPU_SHUT_V << RTC_CNTL_COCPU_SHUT_S)
#define RTC_CNTL_COCPU_SHUT_V  0x00000001
#define RTC_CNTL_COCPU_SHUT_S  13

/* RTC_CNTL_COCPU_START_2_INTR_EN : R/W; bitpos: [12:7]; default: 16;
 * time from start cocpu to give start interrupt
 */

#define RTC_CNTL_COCPU_START_2_INTR_EN    0x0000003f
#define RTC_CNTL_COCPU_START_2_INTR_EN_M  (RTC_CNTL_COCPU_START_2_INTR_EN_V << RTC_CNTL_COCPU_START_2_INTR_EN_S)
#define RTC_CNTL_COCPU_START_2_INTR_EN_V  0x0000003f
#define RTC_CNTL_COCPU_START_2_INTR_EN_S  7

/* RTC_CNTL_COCPU_START_2_RESET_DIS : R/W; bitpos: [6:1]; default: 8;
 * time from start cocpu to pull down reset
 */

#define RTC_CNTL_COCPU_START_2_RESET_DIS    0x0000003f
#define RTC_CNTL_COCPU_START_2_RESET_DIS_M  (RTC_CNTL_COCPU_START_2_RESET_DIS_V << RTC_CNTL_COCPU_START_2_RESET_DIS_S)
#define RTC_CNTL_COCPU_START_2_RESET_DIS_V  0x0000003f
#define RTC_CNTL_COCPU_START_2_RESET_DIS_S  1

/* RTC_CNTL_COCPU_CLK_FO : R/W; bitpos: [0]; default: 0;
 * cocpu clk force on
 */

#define RTC_CNTL_COCPU_CLK_FO    (BIT(0))
#define RTC_CNTL_COCPU_CLK_FO_M  (RTC_CNTL_COCPU_CLK_FO_V << RTC_CNTL_COCPU_CLK_FO_S)
#define RTC_CNTL_COCPU_CLK_FO_V  0x00000001
#define RTC_CNTL_COCPU_CLK_FO_S  0

/* RTC_CNTL_RTC_TOUCH_CTRL1_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_CTRL1_REG (DR_REG_RTCCNTL_BASE + 0x108)

/* RTC_CNTL_TOUCH_MEAS_NUM : R/W; bitpos: [31:16]; default: 4096;
 * the meas length (in 8MHz)
 */

#define RTC_CNTL_TOUCH_MEAS_NUM    0x0000ffff
#define RTC_CNTL_TOUCH_MEAS_NUM_M  (RTC_CNTL_TOUCH_MEAS_NUM_V << RTC_CNTL_TOUCH_MEAS_NUM_S)
#define RTC_CNTL_TOUCH_MEAS_NUM_V  0x0000ffff
#define RTC_CNTL_TOUCH_MEAS_NUM_S  16

/* RTC_CNTL_TOUCH_SLEEP_CYCLES : R/W; bitpos: [15:0]; default: 256;
 * sleep cycles for timer
 */

#define RTC_CNTL_TOUCH_SLEEP_CYCLES    0x0000ffff
#define RTC_CNTL_TOUCH_SLEEP_CYCLES_M  (RTC_CNTL_TOUCH_SLEEP_CYCLES_V << RTC_CNTL_TOUCH_SLEEP_CYCLES_S)
#define RTC_CNTL_TOUCH_SLEEP_CYCLES_V  0x0000ffff
#define RTC_CNTL_TOUCH_SLEEP_CYCLES_S  0

/* RTC_CNTL_RTC_TOUCH_CTRL2_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_CTRL2_REG (DR_REG_RTCCNTL_BASE + 0x10c)

/* RTC_CNTL_TOUCH_CLKGATE_EN : R/W; bitpos: [31]; default: 0;
 * touch clock enable
 */

