apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_TOUCH_CLKGATE_EN    (BIT(31))
#define RTC_CNTL_TOUCH_CLKGATE_EN_M  (RTC_CNTL_TOUCH_CLKGATE_EN_V << RTC_CNTL_TOUCH_CLKGATE_EN_S)
#define RTC_CNTL_TOUCH_CLKGATE_EN_V  0x00000001
#define RTC_CNTL_TOUCH_CLKGATE_EN_S  31

/* RTC_CNTL_TOUCH_CLK_FO : R/W; bitpos: [30]; default: 0;
 * touch clock force on
 */

#define RTC_CNTL_TOUCH_CLK_FO    (BIT(30))
#define RTC_CNTL_TOUCH_CLK_FO_M  (RTC_CNTL_TOUCH_CLK_FO_V << RTC_CNTL_TOUCH_CLK_FO_S)
#define RTC_CNTL_TOUCH_CLK_FO_V  0x00000001
#define RTC_CNTL_TOUCH_CLK_FO_S  30

/* RTC_CNTL_TOUCH_RESET : R/W; bitpos: [29]; default: 0;
 * reset upgrade touch
 */

#define RTC_CNTL_TOUCH_RESET    (BIT(29))
#define RTC_CNTL_TOUCH_RESET_M  (RTC_CNTL_TOUCH_RESET_V << RTC_CNTL_TOUCH_RESET_S)
#define RTC_CNTL_TOUCH_RESET_V  0x00000001
#define RTC_CNTL_TOUCH_RESET_S  29

/* RTC_CNTL_TOUCH_TIMER_FORCE_DONE : R/W; bitpos: [28:27]; default: 0;
 * force touch timer done
 */

#define RTC_CNTL_TOUCH_TIMER_FORCE_DONE    0x00000003
#define RTC_CNTL_TOUCH_TIMER_FORCE_DONE_M  (RTC_CNTL_TOUCH_TIMER_FORCE_DONE_V << RTC_CNTL_TOUCH_TIMER_FORCE_DONE_S)
#define RTC_CNTL_TOUCH_TIMER_FORCE_DONE_V  0x00000003
#define RTC_CNTL_TOUCH_TIMER_FORCE_DONE_S  27

/* RTC_CNTL_TOUCH_SLP_CYC_DIV : R/W; bitpos: [26:25]; default: 0;
 * when a touch pad is active sleep cycle could be divided by this number
 */

#define RTC_CNTL_TOUCH_SLP_CYC_DIV    0x00000003
#define RTC_CNTL_TOUCH_SLP_CYC_DIV_M  (RTC_CNTL_TOUCH_SLP_CYC_DIV_V << RTC_CNTL_TOUCH_SLP_CYC_DIV_S)
#define RTC_CNTL_TOUCH_SLP_CYC_DIV_V  0x00000003
#define RTC_CNTL_TOUCH_SLP_CYC_DIV_S  25

/* RTC_CNTL_TOUCH_XPD_WAIT : R/W; bitpos: [24:17]; default: 4;
 * the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD
 */

#define RTC_CNTL_TOUCH_XPD_WAIT    0x000000ff
#define RTC_CNTL_TOUCH_XPD_WAIT_M  (RTC_CNTL_TOUCH_XPD_WAIT_V << RTC_CNTL_TOUCH_XPD_WAIT_S)
#define RTC_CNTL_TOUCH_XPD_WAIT_V  0x000000ff
#define RTC_CNTL_TOUCH_XPD_WAIT_S  17

/* RTC_CNTL_TOUCH_START_FORCE : R/W; bitpos: [16]; default: 0;
 * 1: to start touch fsm by SW
 */

#define RTC_CNTL_TOUCH_START_FORCE    (BIT(16))
#define RTC_CNTL_TOUCH_START_FORCE_M  (RTC_CNTL_TOUCH_START_FORCE_V << RTC_CNTL_TOUCH_START_FORCE_S)
#define RTC_CNTL_TOUCH_START_FORCE_V  0x00000001
#define RTC_CNTL_TOUCH_START_FORCE_S  16

/* RTC_CNTL_TOUCH_START_EN : R/W; bitpos: [15]; default: 0;
 * 1: start touch fsm
 */

#define RTC_CNTL_TOUCH_START_EN    (BIT(15))
#define RTC_CNTL_TOUCH_START_EN_M  (RTC_CNTL_TOUCH_START_EN_V << RTC_CNTL_TOUCH_START_EN_S)
#define RTC_CNTL_TOUCH_START_EN_V  0x00000001
#define RTC_CNTL_TOUCH_START_EN_S  15

/* RTC_CNTL_TOUCH_START_FSM_EN : R/W; bitpos: [14]; default: 1;
 * 1: TOUCH_START & TOUCH_XPD is controlled by touch fsm
 */

#define RTC_CNTL_TOUCH_START_FSM_EN    (BIT(14))
#define RTC_CNTL_TOUCH_START_FSM_EN_M  (RTC_CNTL_TOUCH_START_FSM_EN_V << RTC_CNTL_TOUCH_START_FSM_EN_S)
#define RTC_CNTL_TOUCH_START_FSM_EN_V  0x00000001
#define RTC_CNTL_TOUCH_START_FSM_EN_S  14

/* RTC_CNTL_TOUCH_SLP_TIMER_EN : R/W; bitpos: [13]; default: 0;
 * touch timer enable bit
 */

#define RTC_CNTL_TOUCH_SLP_TIMER_EN    (BIT(13))
#define RTC_CNTL_TOUCH_SLP_TIMER_EN_M  (RTC_CNTL_TOUCH_SLP_TIMER_EN_V << RTC_CNTL_TOUCH_SLP_TIMER_EN_S)
#define RTC_CNTL_TOUCH_SLP_TIMER_EN_V  0x00000001
#define RTC_CNTL_TOUCH_SLP_TIMER_EN_S  13

/* RTC_CNTL_TOUCH_DBIAS : R/W; bitpos: [12]; default: 0;
 * 1:use self bias 0:use bandgap bias
 */

#define RTC_CNTL_TOUCH_DBIAS    (BIT(12))
#define RTC_CNTL_TOUCH_DBIAS_M  (RTC_CNTL_TOUCH_DBIAS_V << RTC_CNTL_TOUCH_DBIAS_S)
#define RTC_CNTL_TOUCH_DBIAS_V  0x00000001
#define RTC_CNTL_TOUCH_DBIAS_S  12

/* RTC_CNTL_TOUCH_REFC : R/W; bitpos: [11:9]; default: 0;
 * TOUCH pad0 reference cap
 */

#define RTC_CNTL_TOUCH_REFC    0x00000007
#define RTC_CNTL_TOUCH_REFC_M  (RTC_CNTL_TOUCH_REFC_V << RTC_CNTL_TOUCH_REFC_S)
#define RTC_CNTL_TOUCH_REFC_V  0x00000007
#define RTC_CNTL_TOUCH_REFC_S  9

/* RTC_CNTL_TOUCH_XPD_BIAS : R/W; bitpos: [8]; default: 0;
 * TOUCH_XPD_BIAS
 */

#define RTC_CNTL_TOUCH_XPD_BIAS    (BIT(8))
#define RTC_CNTL_TOUCH_XPD_BIAS_M  (RTC_CNTL_TOUCH_XPD_BIAS_V << RTC_CNTL_TOUCH_XPD_BIAS_S)
#define RTC_CNTL_TOUCH_XPD_BIAS_V  0x00000001
#define RTC_CNTL_TOUCH_XPD_BIAS_S  8

/* RTC_CNTL_TOUCH_DREFH : R/W; bitpos: [7:6]; default: 3;
 * TOUCH_DREFH
 */

#define RTC_CNTL_TOUCH_DREFH    0x00000003
#define RTC_CNTL_TOUCH_DREFH_M  (RTC_CNTL_TOUCH_DREFH_V << RTC_CNTL_TOUCH_DREFH_S)
#define RTC_CNTL_TOUCH_DREFH_V  0x00000003
#define RTC_CNTL_TOUCH_DREFH_S  6

/* RTC_CNTL_TOUCH_DREFL : R/W; bitpos: [5:4]; default: 0;
 * TOUCH_DREFL
 */

#define RTC_CNTL_TOUCH_DREFL    0x00000003
#define RTC_CNTL_TOUCH_DREFL_M  (RTC_CNTL_TOUCH_DREFL_V << RTC_CNTL_TOUCH_DREFL_S)
#define RTC_CNTL_TOUCH_DREFL_V  0x00000003
#define RTC_CNTL_TOUCH_DREFL_S  4

/* RTC_CNTL_TOUCH_DRANGE : R/W; bitpos: [3:2]; default: 3;
 * TOUCH_DRANGE
 */

#define RTC_CNTL_TOUCH_DRANGE    0x00000003
#define RTC_CNTL_TOUCH_DRANGE_M  (RTC_CNTL_TOUCH_DRANGE_V << RTC_CNTL_TOUCH_DRANGE_S)
#define RTC_CNTL_TOUCH_DRANGE_V  0x00000003
#define RTC_CNTL_TOUCH_DRANGE_S  2

/* RTC_CNTL_RTC_TOUCH_SCAN_CTRL_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x110)

/* RTC_CNTL_TOUCH_OUT_RING : R/W; bitpos: [31:28]; default: 15;
 * select out ring pad
 */

#define RTC_CNTL_TOUCH_OUT_RING    0x0000000f
#define RTC_CNTL_TOUCH_OUT_RING_M  (RTC_CNTL_TOUCH_OUT_RING_V << RTC_CNTL_TOUCH_OUT_RING_S)
#define RTC_CNTL_TOUCH_OUT_RING_V  0x0000000f
#define RTC_CNTL_TOUCH_OUT_RING_S  28

/* RTC_CNTL_TOUCH_BUFDRV : R/W; bitpos: [27:25]; default: 0;
 * touch7 buffer driver strength
 */

#define RTC_CNTL_TOUCH_BUFDRV    0x00000007
#define RTC_CNTL_TOUCH_BUFDRV_M  (RTC_CNTL_TOUCH_BUFDRV_V << RTC_CNTL_TOUCH_BUFDRV_S)
#define RTC_CNTL_TOUCH_BUFDRV_V  0x00000007
#define RTC_CNTL_TOUCH_BUFDRV_S  25

/* RTC_CNTL_TOUCH_SCAN_PAD_MAP : R/W; bitpos: [24:10]; default: 0;
 * touch scan mode pad enable map
 */

#define RTC_CNTL_TOUCH_SCAN_PAD_MAP    0x00007fff
#define RTC_CNTL_TOUCH_SCAN_PAD_MAP_M  (RTC_CNTL_TOUCH_SCAN_PAD_MAP_V << RTC_CNTL_TOUCH_SCAN_PAD_MAP_S)
#define RTC_CNTL_TOUCH_SCAN_PAD_MAP_V  0x00007fff
#define RTC_CNTL_TOUCH_SCAN_PAD_MAP_S  10

