apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_TOUCH_SHIELD_PAD_EN : R/W; bitpos: [9]; default: 0;
 * touch pad14 will be used as shield
 */

#define RTC_CNTL_TOUCH_SHIELD_PAD_EN    (BIT(9))
#define RTC_CNTL_TOUCH_SHIELD_PAD_EN_M  (RTC_CNTL_TOUCH_SHIELD_PAD_EN_V << RTC_CNTL_TOUCH_SHIELD_PAD_EN_S)
#define RTC_CNTL_TOUCH_SHIELD_PAD_EN_V  0x00000001
#define RTC_CNTL_TOUCH_SHIELD_PAD_EN_S  9

/* RTC_CNTL_TOUCH_INACTIVE_CONNECTION : R/W; bitpos: [8]; default: 1;
 * inactive touch pads connect to 1: gnd 0: HighZ
 */

#define RTC_CNTL_TOUCH_INACTIVE_CONNECTION    (BIT(8))
#define RTC_CNTL_TOUCH_INACTIVE_CONNECTION_M  (RTC_CNTL_TOUCH_INACTIVE_CONNECTION_V << RTC_CNTL_TOUCH_INACTIVE_CONNECTION_S)
#define RTC_CNTL_TOUCH_INACTIVE_CONNECTION_V  0x00000001
#define RTC_CNTL_TOUCH_INACTIVE_CONNECTION_S  8

/* RTC_CNTL_TOUCH_DENOISE_EN : R/W; bitpos: [2]; default: 0;
 * touch pad0 will be used to de-noise
 */

#define RTC_CNTL_TOUCH_DENOISE_EN    (BIT(2))
#define RTC_CNTL_TOUCH_DENOISE_EN_M  (RTC_CNTL_TOUCH_DENOISE_EN_V << RTC_CNTL_TOUCH_DENOISE_EN_S)
#define RTC_CNTL_TOUCH_DENOISE_EN_V  0x00000001
#define RTC_CNTL_TOUCH_DENOISE_EN_S  2

/* RTC_CNTL_TOUCH_DENOISE_RES : R/W; bitpos: [1:0]; default: 2;
 * De-noise resolution: 12/10/8/4 bit
 */

#define RTC_CNTL_TOUCH_DENOISE_RES    0x00000003
#define RTC_CNTL_TOUCH_DENOISE_RES_M  (RTC_CNTL_TOUCH_DENOISE_RES_V << RTC_CNTL_TOUCH_DENOISE_RES_S)
#define RTC_CNTL_TOUCH_DENOISE_RES_V  0x00000003
#define RTC_CNTL_TOUCH_DENOISE_RES_S  0

/* RTC_CNTL_RTC_TOUCH_SLP_THRES_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_SLP_THRES_REG (DR_REG_RTCCNTL_BASE + 0x114)

/* RTC_CNTL_TOUCH_SLP_PAD : R/W; bitpos: [31:27]; default: 15;
 * configure which pad as slp pad
 */

#define RTC_CNTL_TOUCH_SLP_PAD    0x0000001f
#define RTC_CNTL_TOUCH_SLP_PAD_M  (RTC_CNTL_TOUCH_SLP_PAD_V << RTC_CNTL_TOUCH_SLP_PAD_S)
#define RTC_CNTL_TOUCH_SLP_PAD_V  0x0000001f
#define RTC_CNTL_TOUCH_SLP_PAD_S  27

/* RTC_CNTL_TOUCH_SLP_APPROACH_EN : R/W; bitpos: [26]; default: 0;
 * sleep pad approach function enable
 */

#define RTC_CNTL_TOUCH_SLP_APPROACH_EN    (BIT(26))
#define RTC_CNTL_TOUCH_SLP_APPROACH_EN_M  (RTC_CNTL_TOUCH_SLP_APPROACH_EN_V << RTC_CNTL_TOUCH_SLP_APPROACH_EN_S)
#define RTC_CNTL_TOUCH_SLP_APPROACH_EN_V  0x00000001
#define RTC_CNTL_TOUCH_SLP_APPROACH_EN_S  26

/* RTC_CNTL_TOUCH_SLP_TH : R/W; bitpos: [21:0]; default: 0;
 * the threshold for sleep touch pad
 */

#define RTC_CNTL_TOUCH_SLP_TH    0x003fffff
#define RTC_CNTL_TOUCH_SLP_TH_M  (RTC_CNTL_TOUCH_SLP_TH_V << RTC_CNTL_TOUCH_SLP_TH_S)
#define RTC_CNTL_TOUCH_SLP_TH_V  0x003fffff
#define RTC_CNTL_TOUCH_SLP_TH_S  0

/* RTC_CNTL_RTC_TOUCH_APPROACH_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_REG (DR_REG_RTCCNTL_BASE + 0x118)

/* RTC_CNTL_TOUCH_APPROACH_MEAS_TIME : R/W; bitpos: [31:24]; default: 80;
 * approach pads total meas times
 */

#define RTC_CNTL_TOUCH_APPROACH_MEAS_TIME    0x000000ff
#define RTC_CNTL_TOUCH_APPROACH_MEAS_TIME_M  (RTC_CNTL_TOUCH_APPROACH_MEAS_TIME_V << RTC_CNTL_TOUCH_APPROACH_MEAS_TIME_S)
#define RTC_CNTL_TOUCH_APPROACH_MEAS_TIME_V  0x000000ff
#define RTC_CNTL_TOUCH_APPROACH_MEAS_TIME_S  24

/* RTC_CNTL_TOUCH_SLP_CHANNEL_CLR : WO; bitpos: [23]; default: 0;
 * clear touch slp channel
 */

#define RTC_CNTL_TOUCH_SLP_CHANNEL_CLR    (BIT(23))
#define RTC_CNTL_TOUCH_SLP_CHANNEL_CLR_M  (RTC_CNTL_TOUCH_SLP_CHANNEL_CLR_V << RTC_CNTL_TOUCH_SLP_CHANNEL_CLR_S)
#define RTC_CNTL_TOUCH_SLP_CHANNEL_CLR_V  0x00000001
#define RTC_CNTL_TOUCH_SLP_CHANNEL_CLR_S  23

/* RTC_CNTL_RTC_TOUCH_FILTER_CTRL_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_FILTER_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x11c)

/* RTC_CNTL_TOUCH_FILTER_EN : R/W; bitpos: [31]; default: 1;
 * touch filter enable
 */

#define RTC_CNTL_TOUCH_FILTER_EN    (BIT(31))
#define RTC_CNTL_TOUCH_FILTER_EN_M  (RTC_CNTL_TOUCH_FILTER_EN_V << RTC_CNTL_TOUCH_FILTER_EN_S)
#define RTC_CNTL_TOUCH_FILTER_EN_V  0x00000001
#define RTC_CNTL_TOUCH_FILTER_EN_S  31

/* RTC_CNTL_TOUCH_FILTER_MODE : R/W; bitpos: [30:28]; default: 1;
 * 0: IIR ? 1: IIR ? 2: IIR 1/8 3: Jitter
 */

#define RTC_CNTL_TOUCH_FILTER_MODE    0x00000007
#define RTC_CNTL_TOUCH_FILTER_MODE_M  (RTC_CNTL_TOUCH_FILTER_MODE_V << RTC_CNTL_TOUCH_FILTER_MODE_S)
#define RTC_CNTL_TOUCH_FILTER_MODE_V  0x00000007
#define RTC_CNTL_TOUCH_FILTER_MODE_S  28

/* RTC_CNTL_TOUCH_DEBOUNCE : R/W; bitpos: [27:25]; default: 3;
 * debounce counter
 */

#define RTC_CNTL_TOUCH_DEBOUNCE    0x00000007
#define RTC_CNTL_TOUCH_DEBOUNCE_M  (RTC_CNTL_TOUCH_DEBOUNCE_V << RTC_CNTL_TOUCH_DEBOUNCE_S)
#define RTC_CNTL_TOUCH_DEBOUNCE_V  0x00000007
#define RTC_CNTL_TOUCH_DEBOUNCE_S  25

/* RTC_CNTL_TOUCH_HYSTERESIS : R/W; bitpos: [24:23]; default: 1;
 * hysteresis
 */

#define RTC_CNTL_TOUCH_HYSTERESIS    0x00000003
#define RTC_CNTL_TOUCH_HYSTERESIS_M  (RTC_CNTL_TOUCH_HYSTERESIS_V << RTC_CNTL_TOUCH_HYSTERESIS_S)
#define RTC_CNTL_TOUCH_HYSTERESIS_V  0x00000003
#define RTC_CNTL_TOUCH_HYSTERESIS_S  23

/* RTC_CNTL_TOUCH_NOISE_THRES : R/W; bitpos: [22:21]; default: 1;
 * noise thres
 */

#define RTC_CNTL_TOUCH_NOISE_THRES    0x00000003
#define RTC_CNTL_TOUCH_NOISE_THRES_M  (RTC_CNTL_TOUCH_NOISE_THRES_V << RTC_CNTL_TOUCH_NOISE_THRES_S)
#define RTC_CNTL_TOUCH_NOISE_THRES_V  0x00000003
#define RTC_CNTL_TOUCH_NOISE_THRES_S  21

/* RTC_CNTL_TOUCH_NEG_NOISE_THRES : R/W; bitpos: [20:19]; default: 1;
 * neg noise thres
 */

#define RTC_CNTL_TOUCH_NEG_NOISE_THRES    0x00000003
#define RTC_CNTL_TOUCH_NEG_NOISE_THRES_M  (RTC_CNTL_TOUCH_NEG_NOISE_THRES_V << RTC_CNTL_TOUCH_NEG_NOISE_THRES_S)
#define RTC_CNTL_TOUCH_NEG_NOISE_THRES_V  0x00000003
#define RTC_CNTL_TOUCH_NEG_NOISE_THRES_S  19

/* RTC_CNTL_TOUCH_NEG_NOISE_LIMIT : R/W; bitpos: [18:15]; default: 5;
 * negative threshold counter limit
 */

#define RTC_CNTL_TOUCH_NEG_NOISE_LIMIT    0x0000000f
#define RTC_CNTL_TOUCH_NEG_NOISE_LIMIT_M  (RTC_CNTL_TOUCH_NEG_NOISE_LIMIT_V << RTC_CNTL_TOUCH_NEG_NOISE_LIMIT_S)
#define RTC_CNTL_TOUCH_NEG_NOISE_LIMIT_V  0x0000000f
#define RTC_CNTL_TOUCH_NEG_NOISE_LIMIT_S  15

