apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_USB_PAD_PULL_OVERRIDE : R/W; bitpos: [5]; default: 0;
 * reg_usb_pad_pull_override
 */

#define RTC_CNTL_USB_PAD_PULL_OVERRIDE    (BIT(5))
#define RTC_CNTL_USB_PAD_PULL_OVERRIDE_M  (RTC_CNTL_USB_PAD_PULL_OVERRIDE_V << RTC_CNTL_USB_PAD_PULL_OVERRIDE_S)
#define RTC_CNTL_USB_PAD_PULL_OVERRIDE_V  0x00000001
#define RTC_CNTL_USB_PAD_PULL_OVERRIDE_S  5

/* RTC_CNTL_USB_VREF_OVERRIDE : R/W; bitpos: [4]; default: 0;
 * reg_usb_vref_override
 */

#define RTC_CNTL_USB_VREF_OVERRIDE    (BIT(4))
#define RTC_CNTL_USB_VREF_OVERRIDE_M  (RTC_CNTL_USB_VREF_OVERRIDE_V << RTC_CNTL_USB_VREF_OVERRIDE_S)
#define RTC_CNTL_USB_VREF_OVERRIDE_V  0x00000001
#define RTC_CNTL_USB_VREF_OVERRIDE_S  4

/* RTC_CNTL_USB_VREFL : R/W; bitpos: [3:2]; default: 0;
 * reg_usb_vrefl
 */

#define RTC_CNTL_USB_VREFL    0x00000003
#define RTC_CNTL_USB_VREFL_M  (RTC_CNTL_USB_VREFL_V << RTC_CNTL_USB_VREFL_S)
#define RTC_CNTL_USB_VREFL_V  0x00000003
#define RTC_CNTL_USB_VREFL_S  2

/* RTC_CNTL_USB_VREFH : R/W; bitpos: [1:0]; default: 0;
 * reg_usb_vrefh
 */

#define RTC_CNTL_USB_VREFH    0x00000003
#define RTC_CNTL_USB_VREFH_M  (RTC_CNTL_USB_VREFH_V << RTC_CNTL_USB_VREFH_S)
#define RTC_CNTL_USB_VREFH_V  0x00000003
#define RTC_CNTL_USB_VREFH_S  0

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_CTRL_REG register
 * configure touch controller
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x124)

/* RTC_CNTL_TOUCH_TIMEOUT_EN : R/W; bitpos: [22]; default: 1;
 * enable touch timerout
 */

#define RTC_CNTL_TOUCH_TIMEOUT_EN    (BIT(22))
#define RTC_CNTL_TOUCH_TIMEOUT_EN_M  (RTC_CNTL_TOUCH_TIMEOUT_EN_V << RTC_CNTL_TOUCH_TIMEOUT_EN_S)
#define RTC_CNTL_TOUCH_TIMEOUT_EN_V  0x00000001
#define RTC_CNTL_TOUCH_TIMEOUT_EN_S  22

/* RTC_CNTL_TOUCH_TIMEOUT_NUM : R/W; bitpos: [21:0]; default: 4194303;
 * configure touch timerout time
 */

#define RTC_CNTL_TOUCH_TIMEOUT_NUM    0x003fffff
#define RTC_CNTL_TOUCH_TIMEOUT_NUM_M  (RTC_CNTL_TOUCH_TIMEOUT_NUM_V << RTC_CNTL_TOUCH_TIMEOUT_NUM_S)
#define RTC_CNTL_TOUCH_TIMEOUT_NUM_V  0x003fffff
#define RTC_CNTL_TOUCH_TIMEOUT_NUM_S  0

/* RTC_CNTL_RTC_SLP_REJECT_CAUSE_REG register
 * get reject casue
 */

#define RTC_CNTL_RTC_SLP_REJECT_CAUSE_REG (DR_REG_RTCCNTL_BASE + 0x128)

/* RTC_CNTL_REJECT_CAUSE : RO; bitpos: [17:0]; default: 0;
 * sleep reject cause
 */

#define RTC_CNTL_REJECT_CAUSE    0x0003ffff
#define RTC_CNTL_REJECT_CAUSE_M  (RTC_CNTL_REJECT_CAUSE_V << RTC_CNTL_REJECT_CAUSE_S)
#define RTC_CNTL_REJECT_CAUSE_V  0x0003ffff
#define RTC_CNTL_REJECT_CAUSE_S  0

/* RTC_CNTL_RTC_OPTION1_REG register
 * rtc common configure
 */

#define RTC_CNTL_RTC_OPTION1_REG (DR_REG_RTCCNTL_BASE + 0x12c)

/* RTC_CNTL_FORCE_DOWNLOAD_BOOT : R/W; bitpos: [0]; default: 0;
 * force chip entry download boot by sw
 */

#define RTC_CNTL_FORCE_DOWNLOAD_BOOT    (BIT(0))
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_M  (RTC_CNTL_FORCE_DOWNLOAD_BOOT_V << RTC_CNTL_FORCE_DOWNLOAD_BOOT_S)
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_V  0x00000001
#define RTC_CNTL_FORCE_DOWNLOAD_BOOT_S  0

/* RTC_CNTL_RTC_SLP_WAKEUP_CAUSE_REG register
 * get wakeup cause
 */

#define RTC_CNTL_RTC_SLP_WAKEUP_CAUSE_REG (DR_REG_RTCCNTL_BASE + 0x130)

/* RTC_CNTL_WAKEUP_CAUSE : RO; bitpos: [16:0]; default: 0;
 * sleep wakeup cause
 */

#define RTC_CNTL_WAKEUP_CAUSE    0x0001ffff
#define RTC_CNTL_WAKEUP_CAUSE_M  (RTC_CNTL_WAKEUP_CAUSE_V << RTC_CNTL_WAKEUP_CAUSE_S)
#define RTC_CNTL_WAKEUP_CAUSE_V  0x0001ffff
#define RTC_CNTL_WAKEUP_CAUSE_S  0

/* RTC_CNTL_RTC_ULP_CP_TIMER_1_REG register
 * configure ulp sleep time
 */

#define RTC_CNTL_RTC_ULP_CP_TIMER_1_REG (DR_REG_RTCCNTL_BASE + 0x134)

/* RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE : R/W; bitpos: [31:8]; default: 200;
 * sleep cycles for ULP-coprocessor timer
 */

#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE    0x00ffffff
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_M  (RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_V << RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_S)
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_V  0x00ffffff
#define RTC_CNTL_ULP_CP_TIMER_SLP_CYCLE_S  8

/* RTC_CNTL_INT_ENA_RTC_W1TS_REG register
 * oneset rtc interrupt
 */

#define RTC_CNTL_INT_ENA_RTC_W1TS_REG (DR_REG_RTCCNTL_BASE + 0x138)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS : WO; bitpos: [20];
 * default: 0;
 * enbale touch approach_loop done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS : WO; bitpos: [19]; default: 0;
 * enbale gitch det interrupt
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS_M  (RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS_V << RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TS_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS : WO; bitpos: [18]; default: 0;
 * enable touch timeout interrupt
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TS_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS : WO; bitpos: [17]; default: 0;
 * enable cocpu trap interrupt
 */

#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS_V << RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TS_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS : WO; bitpos: [16]; default: 0;
 * enable xtal32k_dead  interrupt
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TS_S  16

/* RTC_CNTL_RTC_SWD_INT_ENA_W1TS : WO; bitpos: [15]; default: 0;
 * enable super watch dog interrupt
 */

#define RTC_CNTL_RTC_SWD_INT_ENA_W1TS    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TS_M  (RTC_CNTL_RTC_SWD_INT_ENA_W1TS_V << RTC_CNTL_RTC_SWD_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TS_S  15

/* RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS : WO; bitpos: [14]; default: 0;
 * enable saradc2 interrupt
 */

