apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS_M  (RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS_V << RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TS_S  14

/* RTC_CNTL_RTC_COCPU_INT_ENA_W1TS : WO; bitpos: [13]; default: 0;
 * enable riscV cocpu interrupt
 */

#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TS    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TS_M  (RTC_CNTL_RTC_COCPU_INT_ENA_W1TS_V << RTC_CNTL_RTC_COCPU_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TS_S  13

/* RTC_CNTL_RTC_TSENS_INT_ENA_W1TS : WO; bitpos: [12]; default: 0;
 * enable tsens interrupt
 */

#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TS    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TSENS_INT_ENA_W1TS_V << RTC_CNTL_RTC_TSENS_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TS_S  12

/* RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS : WO; bitpos: [11]; default: 0;
 * enable saradc1 interrupt
 */

#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS_M  (RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS_V << RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TS_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS : WO; bitpos: [10]; default: 0;
 * enable RTC main timer interrupt
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS_V << RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TS_S  10

/* RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS : WO; bitpos: [9]; default: 0;
 * enable brown out interrupt
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS_M  (RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS_V << RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TS_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS : WO; bitpos: [8]; default: 0;
 * enable touch inactive interrupt
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TS_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS : WO; bitpos: [7]; default: 0;
 * enable touch active interrupt
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TS_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS : WO; bitpos: [6]; default: 0;
 * enable touch done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TS_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS : WO; bitpos: [5]; default: 0;
 * enable ULP-coprocessor interrupt
 */

#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS_M  (RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS_V << RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TS_S  5

/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS : WO; bitpos: [4]; default: 0;
 * enable touch scan done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TS_S  4

/* RTC_CNTL_RTC_WDT_INT_ENA_W1TS : WO; bitpos: [3]; default: 0;
 * enable RTC WDT interrupt
 */

#define RTC_CNTL_RTC_WDT_INT_ENA_W1TS    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TS_M  (RTC_CNTL_RTC_WDT_INT_ENA_W1TS_V << RTC_CNTL_RTC_WDT_INT_ENA_W1TS_S)
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TS_S  3

/* RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS : WO; bitpos: [2]; default: 0;
 * enable SDIO idle interrupt
 */

#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_M  (RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_V << RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_S)
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TS_S  2

/* RTC_CNTL_SLP_REJECT_INT_ENA_W1TS : WO; bitpos: [1]; default: 0;
 * enable sleep reject interrupt
 */

#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_M  (RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_V << RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TS_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS : WO; bitpos: [0]; default: 0;
 * enable sleep wakeup interrupt
 */

#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TS_S  0

/* RTC_CNTL_INT_ENA_RTC_W1TC_REG register
 * oneset clr rtc interrupt enable
 */

#define RTC_CNTL_INT_ENA_RTC_W1TC_REG (DR_REG_RTCCNTL_BASE + 0x13c)

/* RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC : WO; bitpos: [20];
 * default: 0;
 * enbale touch approach_loop done interrupt
 */

