apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC    (BIT(20))
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_S  20

/* RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC : WO; bitpos: [19]; default: 0;
 * enbale gitch det interrupt
 */

#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC    (BIT(19))
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC_M  (RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC_V << RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_GLITCH_DET_INT_ENA_W1TC_S  19

/* RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC : WO; bitpos: [18]; default: 0;
 * enable touch timeout interrupt
 */

#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC    (BIT(18))
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_TIMEOUT_INT_ENA_W1TC_S  18

/* RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC : WO; bitpos: [17]; default: 0;
 * enable cocpu trap interrupt
 */

#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC    (BIT(17))
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC_M  (RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC_V << RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_COCPU_TRAP_INT_ENA_W1TC_S  17

/* RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC : WO; bitpos: [16]; default: 0;
 * enable xtal32k_dead  interrupt
 */

#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC    (BIT(16))
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC_M  (RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC_V << RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_XTAL32K_DEAD_INT_ENA_W1TC_S  16

/* RTC_CNTL_RTC_SWD_INT_ENA_W1TC : WO; bitpos: [15]; default: 0;
 * enable super watch dog interrupt
 */

#define RTC_CNTL_RTC_SWD_INT_ENA_W1TC    (BIT(15))
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TC_M  (RTC_CNTL_RTC_SWD_INT_ENA_W1TC_V << RTC_CNTL_RTC_SWD_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_SWD_INT_ENA_W1TC_S  15

/* RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC : WO; bitpos: [14]; default: 0;
 * enable saradc2 interrupt
 */

#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC    (BIT(14))
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC_M  (RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC_V << RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_SARADC2_INT_ENA_W1TC_S  14

/* RTC_CNTL_RTC_COCPU_INT_ENA_W1TC : WO; bitpos: [13]; default: 0;
 * enable riscV cocpu interrupt
 */

#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TC    (BIT(13))
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TC_M  (RTC_CNTL_RTC_COCPU_INT_ENA_W1TC_V << RTC_CNTL_RTC_COCPU_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_COCPU_INT_ENA_W1TC_S  13

/* RTC_CNTL_RTC_TSENS_INT_ENA_W1TC : WO; bitpos: [12]; default: 0;
 * enable tsens interrupt
 */

#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TC    (BIT(12))
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TSENS_INT_ENA_W1TC_V << RTC_CNTL_RTC_TSENS_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TSENS_INT_ENA_W1TC_S  12

/* RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC : WO; bitpos: [11]; default: 0;
 * enable saradc1 interrupt
 */

#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC    (BIT(11))
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC_M  (RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC_V << RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_SARADC1_INT_ENA_W1TC_S  11

/* RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC : WO; bitpos: [10]; default: 0;
 * enable RTC main timer interrupt
 */

#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC    (BIT(10))
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC_M  (RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC_V << RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_MAIN_TIMER_INT_ENA_W1TC_S  10

/* RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC : WO; bitpos: [9]; default: 0;
 * enable brown out interrupt
 */

#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC    (BIT(9))
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC_M  (RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC_V << RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_BROWN_OUT_INT_ENA_W1TC_S  9

/* RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC : WO; bitpos: [8]; default: 0;
 * enable touch inactive interrupt
 */

#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC    (BIT(8))
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_INACTIVE_INT_ENA_W1TC_S  8

/* RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC : WO; bitpos: [7]; default: 0;
 * enable touch active interrupt
 */

#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC    (BIT(7))
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_ACTIVE_INT_ENA_W1TC_S  7

/* RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC : WO; bitpos: [6]; default: 0;
 * enable touch done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC    (BIT(6))
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_DONE_INT_ENA_W1TC_S  6

/* RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC : WO; bitpos: [5]; default: 0;
 * enable ULP-coprocessor interrupt
 */

#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC    (BIT(5))
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC_M  (RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC_V << RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_ULP_CP_INT_ENA_W1TC_S  5

