apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC : WO; bitpos: [4]; default: 0;
 * enable touch scan done interrupt
 */

#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC    (BIT(4))
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC_M  (RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC_V << RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_TOUCH_SCAN_DONE_INT_ENA_W1TC_S  4

/* RTC_CNTL_RTC_WDT_INT_ENA_W1TC : WO; bitpos: [3]; default: 0;
 * enable RTC WDT interrupt
 */

#define RTC_CNTL_RTC_WDT_INT_ENA_W1TC    (BIT(3))
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TC_M  (RTC_CNTL_RTC_WDT_INT_ENA_W1TC_V << RTC_CNTL_RTC_WDT_INT_ENA_W1TC_S)
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_RTC_WDT_INT_ENA_W1TC_S  3

/* RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC : WO; bitpos: [2]; default: 0;
 * enable SDIO idle interrupt
 */

#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC    (BIT(2))
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_M  (RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_V << RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_S)
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_SDIO_IDLE_INT_ENA_W1TC_S  2

/* RTC_CNTL_SLP_REJECT_INT_ENA_W1TC : WO; bitpos: [1]; default: 0;
 * enable sleep reject interrupt
 */

#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC    (BIT(1))
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_M  (RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_V << RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_S)
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_SLP_REJECT_INT_ENA_W1TC_S  1

/* RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC : WO; bitpos: [0]; default: 0;
 * enable sleep wakeup interrupt
 */

#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC    (BIT(0))
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_M  (RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_V << RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_S)
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_V  0x00000001
#define RTC_CNTL_SLP_WAKEUP_INT_ENA_W1TC_S  0

/* RTC_CNTL_RETENTION_CTRL_REG register
 * configure retention
 */

#define RTC_CNTL_RETENTION_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x140)

/* RTC_CNTL_RETENTION_WAIT : R/W; bitpos: [31:25]; default: 20;
 * wait cycles for rention operation
 */

#define RTC_CNTL_RETENTION_WAIT    0x0000007f
#define RTC_CNTL_RETENTION_WAIT_M  (RTC_CNTL_RETENTION_WAIT_V << RTC_CNTL_RETENTION_WAIT_S)
#define RTC_CNTL_RETENTION_WAIT_V  0x0000007f
#define RTC_CNTL_RETENTION_WAIT_S  25

/* RTC_CNTL_RETENTION_EN : R/W; bitpos: [24]; default: 0;
 * enable retention
 */

#define RTC_CNTL_RETENTION_EN    (BIT(24))
#define RTC_CNTL_RETENTION_EN_M  (RTC_CNTL_RETENTION_EN_V << RTC_CNTL_RETENTION_EN_S)
#define RTC_CNTL_RETENTION_EN_V  0x00000001
#define RTC_CNTL_RETENTION_EN_S  24

/* RTC_CNTL_RETENTION_CLKOFF_WAIT : R/W; bitpos: [23:20]; default: 3;
 * wait clk off cycle
 */

#define RTC_CNTL_RETENTION_CLKOFF_WAIT    0x0000000f
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_M  (RTC_CNTL_RETENTION_CLKOFF_WAIT_V << RTC_CNTL_RETENTION_CLKOFF_WAIT_S)
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_V  0x0000000f
#define RTC_CNTL_RETENTION_CLKOFF_WAIT_S  20

/* RTC_CNTL_RETENTION_DONE_WAIT : R/W; bitpos: [19:17]; default: 2;
 * wait retention done cycle
 */

#define RTC_CNTL_RETENTION_DONE_WAIT    0x00000007
#define RTC_CNTL_RETENTION_DONE_WAIT_M  (RTC_CNTL_RETENTION_DONE_WAIT_V << RTC_CNTL_RETENTION_DONE_WAIT_S)
#define RTC_CNTL_RETENTION_DONE_WAIT_V  0x00000007
#define RTC_CNTL_RETENTION_DONE_WAIT_S  17

/* RTC_CNTL_RETENTION_CLK_SEL : R/W; bitpos: [16]; default: 0;
 * No public
 */

#define RTC_CNTL_RETENTION_CLK_SEL    (BIT(16))
#define RTC_CNTL_RETENTION_CLK_SEL_M  (RTC_CNTL_RETENTION_CLK_SEL_V << RTC_CNTL_RETENTION_CLK_SEL_S)
#define RTC_CNTL_RETENTION_CLK_SEL_V  0x00000001
#define RTC_CNTL_RETENTION_CLK_SEL_S  16

/* RTC_CNTL_RETENTION_TARGET : R/W; bitpos: [15:14]; default: 0;
 * congfigure retention target cpu and/or tag
 */

#define RTC_CNTL_RETENTION_TARGET    0x00000003
#define RTC_CNTL_RETENTION_TARGET_M  (RTC_CNTL_RETENTION_TARGET_V << RTC_CNTL_RETENTION_TARGET_S)
#define RTC_CNTL_RETENTION_TARGET_V  0x00000003
#define RTC_CNTL_RETENTION_TARGET_S  14

/* RTC_CNTL_RETENTION_TAG_MODE : R/W; bitpos: [13:10]; default: 0;
 * No public
 */

#define RTC_CNTL_RETENTION_TAG_MODE    0x0000000f
#define RTC_CNTL_RETENTION_TAG_MODE_M  (RTC_CNTL_RETENTION_TAG_MODE_V << RTC_CNTL_RETENTION_TAG_MODE_S)
#define RTC_CNTL_RETENTION_TAG_MODE_V  0x0000000f
#define RTC_CNTL_RETENTION_TAG_MODE_S  10

/* RTC_CNTL_PG_CTRL_REG register
 * configure power glitch
 */

#define RTC_CNTL_PG_CTRL_REG (DR_REG_RTCCNTL_BASE + 0x144)

/* RTC_CNTL_POWER_GLITCH_EN : R/W; bitpos: [31]; default: 0;
 * enable power glitch
 */

#define RTC_CNTL_POWER_GLITCH_EN    (BIT(31))
#define RTC_CNTL_POWER_GLITCH_EN_M  (RTC_CNTL_POWER_GLITCH_EN_V << RTC_CNTL_POWER_GLITCH_EN_S)
#define RTC_CNTL_POWER_GLITCH_EN_V  0x00000001
#define RTC_CNTL_POWER_GLITCH_EN_S  31

/* RTC_CNTL_POWER_GLITCH_EFUSE_SEL : R/W; bitpos: [30]; default: 0;
 * select use analog fib signal
 */

#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL    (BIT(30))
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_M  (RTC_CNTL_POWER_GLITCH_EFUSE_SEL_V << RTC_CNTL_POWER_GLITCH_EFUSE_SEL_S)
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_V  0x00000001
#define RTC_CNTL_POWER_GLITCH_EFUSE_SEL_S  30

/* RTC_CNTL_POWER_GLITCH_FORCE_PU : R/W; bitpos: [29]; default: 0;
 * force power glitch enable
 */

#define RTC_CNTL_POWER_GLITCH_FORCE_PU    (BIT(29))
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_M  (RTC_CNTL_POWER_GLITCH_FORCE_PU_V << RTC_CNTL_POWER_GLITCH_FORCE_PU_S)
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_V  0x00000001
#define RTC_CNTL_POWER_GLITCH_FORCE_PU_S  29

/* RTC_CNTL_POWER_GLITCH_FORCE_PD : R/W; bitpos: [28]; default: 0;
 * force power glitch disable
 */

#define RTC_CNTL_POWER_GLITCH_FORCE_PD    (BIT(28))
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_M  (RTC_CNTL_POWER_GLITCH_FORCE_PD_V << RTC_CNTL_POWER_GLITCH_FORCE_PD_S)
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_V  0x00000001
#define RTC_CNTL_POWER_GLITCH_FORCE_PD_S  28

/* RTC_CNTL_POWER_GLITCH_DSENSE : R/W; bitpos: [27:26]; default: 0;
 * GLITCH_DSENSE
 */

#define RTC_CNTL_POWER_GLITCH_DSENSE    0x00000003
#define RTC_CNTL_POWER_GLITCH_DSENSE_M  (RTC_CNTL_POWER_GLITCH_DSENSE_V << RTC_CNTL_POWER_GLITCH_DSENSE_S)
#define RTC_CNTL_POWER_GLITCH_DSENSE_V  0x00000003
#define RTC_CNTL_POWER_GLITCH_DSENSE_S  26

