apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtccntl.h
/* RTC_CNTL_RTC_FIB_SEL_REG register
 * No public
 */

#define RTC_CNTL_RTC_FIB_SEL_REG (DR_REG_RTCCNTL_BASE + 0x148)

/* RTC_CNTL_RTC_FIB_SEL : R/W; bitpos: [2:0]; default: 7;
 * No public
 */

#define RTC_CNTL_RTC_FIB_SEL    0x00000007
#define RTC_CNTL_RTC_FIB_SEL_M  (RTC_CNTL_RTC_FIB_SEL_V << RTC_CNTL_RTC_FIB_SEL_S)
#define RTC_CNTL_RTC_FIB_SEL_V  0x00000007
#define RTC_CNTL_RTC_FIB_SEL_S  0

/* RTC_CNTL_TOUCH_DAC_REG register
 * configure touch dac
 */

#define RTC_CNTL_TOUCH_DAC_REG (DR_REG_RTCCNTL_BASE + 0x14c)

/* RTC_CNTL_TOUCH_PAD0_DAC : R/W; bitpos: [31:29]; default: 0;
 * configure touch pad dac0
 */

#define RTC_CNTL_TOUCH_PAD0_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD0_DAC_M  (RTC_CNTL_TOUCH_PAD0_DAC_V << RTC_CNTL_TOUCH_PAD0_DAC_S)
#define RTC_CNTL_TOUCH_PAD0_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD0_DAC_S  29

/* RTC_CNTL_TOUCH_PAD1_DAC : R/W; bitpos: [28:26]; default: 0;
 * configure touch pad dac1
 */

#define RTC_CNTL_TOUCH_PAD1_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD1_DAC_M  (RTC_CNTL_TOUCH_PAD1_DAC_V << RTC_CNTL_TOUCH_PAD1_DAC_S)
#define RTC_CNTL_TOUCH_PAD1_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD1_DAC_S  26

/* RTC_CNTL_TOUCH_PAD2_DAC : R/W; bitpos: [25:23]; default: 0;
 * configure touch pad dac2
 */

#define RTC_CNTL_TOUCH_PAD2_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD2_DAC_M  (RTC_CNTL_TOUCH_PAD2_DAC_V << RTC_CNTL_TOUCH_PAD2_DAC_S)
#define RTC_CNTL_TOUCH_PAD2_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD2_DAC_S  23

/* RTC_CNTL_TOUCH_PAD3_DAC : R/W; bitpos: [22:20]; default: 0;
 * configure touch pad dac3
 */

#define RTC_CNTL_TOUCH_PAD3_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD3_DAC_M  (RTC_CNTL_TOUCH_PAD3_DAC_V << RTC_CNTL_TOUCH_PAD3_DAC_S)
#define RTC_CNTL_TOUCH_PAD3_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD3_DAC_S  20

/* RTC_CNTL_TOUCH_PAD4_DAC : R/W; bitpos: [19:17]; default: 0;
 * configure touch pad dac4
 */

#define RTC_CNTL_TOUCH_PAD4_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD4_DAC_M  (RTC_CNTL_TOUCH_PAD4_DAC_V << RTC_CNTL_TOUCH_PAD4_DAC_S)
#define RTC_CNTL_TOUCH_PAD4_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD4_DAC_S  17

/* RTC_CNTL_TOUCH_PAD5_DAC : R/W; bitpos: [16:14]; default: 0;
 * configure touch pad dac5
 */

#define RTC_CNTL_TOUCH_PAD5_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD5_DAC_M  (RTC_CNTL_TOUCH_PAD5_DAC_V << RTC_CNTL_TOUCH_PAD5_DAC_S)
#define RTC_CNTL_TOUCH_PAD5_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD5_DAC_S  14

/* RTC_CNTL_TOUCH_PAD6_DAC : R/W; bitpos: [13:11]; default: 0;
 * configure touch pad dac6
 */

#define RTC_CNTL_TOUCH_PAD6_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD6_DAC_M  (RTC_CNTL_TOUCH_PAD6_DAC_V << RTC_CNTL_TOUCH_PAD6_DAC_S)
#define RTC_CNTL_TOUCH_PAD6_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD6_DAC_S  11

/* RTC_CNTL_TOUCH_PAD7_DAC : R/W; bitpos: [10:8]; default: 0;
 * configure touch pad dac7
 */

#define RTC_CNTL_TOUCH_PAD7_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD7_DAC_M  (RTC_CNTL_TOUCH_PAD7_DAC_V << RTC_CNTL_TOUCH_PAD7_DAC_S)
#define RTC_CNTL_TOUCH_PAD7_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD7_DAC_S  8

/* RTC_CNTL_TOUCH_PAD8_DAC : R/W; bitpos: [7:5]; default: 0;
 * configure touch pad dac8
 */

#define RTC_CNTL_TOUCH_PAD8_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD8_DAC_M  (RTC_CNTL_TOUCH_PAD8_DAC_V << RTC_CNTL_TOUCH_PAD8_DAC_S)
#define RTC_CNTL_TOUCH_PAD8_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD8_DAC_S  5

/* RTC_CNTL_TOUCH_PAD9_DAC : R/W; bitpos: [4:2]; default: 0;
 * configure touch pad dac9
 */

#define RTC_CNTL_TOUCH_PAD9_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD9_DAC_M  (RTC_CNTL_TOUCH_PAD9_DAC_V << RTC_CNTL_TOUCH_PAD9_DAC_S)
#define RTC_CNTL_TOUCH_PAD9_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD9_DAC_S  2

/* RTC_CNTL_TOUCH_DAC1_REG register
 * configure touch dac
 */

#define RTC_CNTL_TOUCH_DAC1_REG (DR_REG_RTCCNTL_BASE + 0x150)

/* RTC_CNTL_TOUCH_PAD10_DAC : R/W; bitpos: [31:29]; default: 0;
 * configure touch pad dac10
 */

#define RTC_CNTL_TOUCH_PAD10_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD10_DAC_M  (RTC_CNTL_TOUCH_PAD10_DAC_V << RTC_CNTL_TOUCH_PAD10_DAC_S)
#define RTC_CNTL_TOUCH_PAD10_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD10_DAC_S  29

/* RTC_CNTL_TOUCH_PAD11_DAC : R/W; bitpos: [28:26]; default: 0;
 * configure touch pad dac11
 */

#define RTC_CNTL_TOUCH_PAD11_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD11_DAC_M  (RTC_CNTL_TOUCH_PAD11_DAC_V << RTC_CNTL_TOUCH_PAD11_DAC_S)
#define RTC_CNTL_TOUCH_PAD11_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD11_DAC_S  26

/* RTC_CNTL_TOUCH_PAD12_DAC : R/W; bitpos: [25:23]; default: 0;
 * configure touch pad dac12
 */

#define RTC_CNTL_TOUCH_PAD12_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD12_DAC_M  (RTC_CNTL_TOUCH_PAD12_DAC_V << RTC_CNTL_TOUCH_PAD12_DAC_S)
#define RTC_CNTL_TOUCH_PAD12_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD12_DAC_S  23

/* RTC_CNTL_TOUCH_PAD13_DAC : R/W; bitpos: [22:20]; default: 0;
 * configure touch pad dac13
 */

#define RTC_CNTL_TOUCH_PAD13_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD13_DAC_M  (RTC_CNTL_TOUCH_PAD13_DAC_V << RTC_CNTL_TOUCH_PAD13_DAC_S)
#define RTC_CNTL_TOUCH_PAD13_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD13_DAC_S  20

/* RTC_CNTL_TOUCH_PAD14_DAC : R/W; bitpos: [19:17]; default: 0;
 * configure touch pad dac14
 */

#define RTC_CNTL_TOUCH_PAD14_DAC    0x00000007
#define RTC_CNTL_TOUCH_PAD14_DAC_M  (RTC_CNTL_TOUCH_PAD14_DAC_V << RTC_CNTL_TOUCH_PAD14_DAC_S)
#define RTC_CNTL_TOUCH_PAD14_DAC_V  0x00000007
#define RTC_CNTL_TOUCH_PAD14_DAC_S  17

/* RTC_CNTL_RTC_COCPU_DISABLE_REG register
 * configure ulp diable
 */

#define RTC_CNTL_RTC_COCPU_DISABLE_REG (DR_REG_RTCCNTL_BASE + 0x154)

/* RTC_CNTL_DISABLE_RTC_CPU : R/W; bitpos: [31]; default: 0;
 * configure ulp diable
 */

#define RTC_CNTL_DISABLE_RTC_CPU    (BIT(31))
#define RTC_CNTL_DISABLE_RTC_CPU_M  (RTC_CNTL_DISABLE_RTC_CPU_V << RTC_CNTL_DISABLE_RTC_CPU_S)
#define RTC_CNTL_DISABLE_RTC_CPU_V  0x00000001
#define RTC_CNTL_DISABLE_RTC_CPU_S  31

/* RTC_CNTL_DATE_REG register
 * version register
 */

#define RTC_CNTL_DATE_REG (DR_REG_RTCCNTL_BASE + 0x1fc)

/* RTC_CNTL_DATE : R/W; bitpos: [27:0]; default: 34607729;
 * version register
 */

#define RTC_CNTL_DATE    0x0fffffff
#define RTC_CNTL_DATE_M  (RTC_CNTL_DATE_V << RTC_CNTL_DATE_S)
#define RTC_CNTL_DATE_V  0x0fffffff
#define RTC_CNTL_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_RTCCNTL_H */
